[
  {
    "title": "Supreme Court Allows US to Deport Venezuelans Under Alien Enemies Act",
    "url": "https://www.theepochtimes.com/us/supreme-court-grants-trumps-request-to-halt-order-in-deportations-case-5835290",
    "text": "The Supreme Court granted President Donald Trump’s request to halt a federal judge’s orders preventing his administration from using the Alien Enemies Act (AEA) to deport suspected members of a Venezuelan gang.\n\nJustice Sonia Sotomayor penned a dissent that was joined by Justices Elena Kagan and Ketanji Brown Jackson. Justice Amy Coney Barrett partially joined Sotomayor’s dissent.\n\n“Detainees are confined in Texas, so venue is improper in the District of Columbia,” the Supreme Court opinion read. It added that while individuals were entitled to an opportunity to challenge their removal, the proper venue was “the district of confinement,” or where the plaintiffs were confined.\n\nThe court stated that “AEA detainees must receive notice after the date of this order that they are subject to removal under the Act. The notice must be afforded within a reasonable time and in such a manner as will allow them to actually seek habeas relief in the proper venue before such removal occurs.”\n\nBoth Sotomayor and Jackson, who issued a separate dissent, argued that the court was acting too quickly and should have considered the issue more carefully.\n\n“The majority flouts well-established limits on its jurisdiction, creates new law on the emergency docket, and elides the serious threat our intervention poses to the lives of individual detainees,” Sotomayor wrote.\n\nThe decision came days after the Supreme Court granted the administration’s request to block a lower court order halting its plan to freeze education grants over concerns about diversity, equity, and inclusion.\n\nQuoting Kagan’s dissent in that case, Sotomayor said the court proceeded with “bare-bones briefing, no argument, and scarce time for reflection.”\n\n“An activist judge in Washington, DC does not have the jurisdiction to seize control of President Trump’s authority to conduct foreign policy and keep the American people safe,” she said.\n\nOn TruthSocial, Trump posted: “The Supreme Court has upheld the Rule of Law in our Nation by allowing a President, whoever that may be, to be able to secure our Borders, and protect our families and our Country, itself.”\n\n“A great day for justice in America!” he added in all caps.\n\nThe decision came after the administration and plaintiffs in the initial case filed dueling briefs to the justices.\n\nTrump appealed Boasberg’s orders to the U.S. Court of Appeals for the District of Columbia Circuit, which declined this past week to grant that relief."
  },
  {
    "title": "Supreme Court Allows US to Deport Venezuelans Under Alien Enemies Act",
    "url": "https://www.theepochtimes.com/us/supreme-court-grants-trumps-request-to-halt-order-in-deportations-case-5835290?cmt=1",
    "text": "The Supreme Court granted President Donald Trump’s request to halt a federal judge’s orders preventing his administration from using the Alien Enemies Act (AEA) to deport suspected members of a Venezuelan gang.\n\nJustice Sonia Sotomayor penned a dissent that was joined by Justices Elena Kagan and Ketanji Brown Jackson. Justice Amy Coney Barrett partially joined Sotomayor’s dissent.\n\n“Detainees are confined in Texas, so venue is improper in the District of Columbia,” the Supreme Court opinion read. It added that while individuals were entitled to an opportunity to challenge their removal, the proper venue was “the district of confinement,” or where the plaintiffs were confined.\n\nThe court stated that “AEA detainees must receive notice after the date of this order that they are subject to removal under the Act. The notice must be afforded within a reasonable time and in such a manner as will allow them to actually seek habeas relief in the proper venue before such removal occurs.”\n\nBoth Sotomayor and Jackson, who issued a separate dissent, argued that the court was acting too quickly and should have considered the issue more carefully.\n\n“The majority flouts well-established limits on its jurisdiction, creates new law on the emergency docket, and elides the serious threat our intervention poses to the lives of individual detainees,” Sotomayor wrote.\n\nThe decision came days after the Supreme Court granted the administration’s request to block a lower court order halting its plan to freeze education grants over concerns about diversity, equity, and inclusion.\n\nQuoting Kagan’s dissent in that case, Sotomayor said the court proceeded with “bare-bones briefing, no argument, and scarce time for reflection.”\n\n“An activist judge in Washington, DC does not have the jurisdiction to seize control of President Trump’s authority to conduct foreign policy and keep the American people safe,” she said.\n\nOn TruthSocial, Trump posted: “The Supreme Court has upheld the Rule of Law in our Nation by allowing a President, whoever that may be, to be able to secure our Borders, and protect our families and our Country, itself.”\n\n“A great day for justice in America!” he added in all caps.\n\nThe decision came after the administration and plaintiffs in the initial case filed dueling briefs to the justices.\n\nTrump appealed Boasberg’s orders to the U.S. Court of Appeals for the District of Columbia Circuit, which declined this past week to grant that relief."
  },
  {
    "title": "Supreme Court Blocks Judge’s Order to Return Man Deported to El Salvador",
    "url": "https://www.theepochtimes.com/us/trump-admin-asks-supreme-court-to-halt-judges-ruling-ordering-return-of-deportee-5838038",
    "text": "The Supreme Court has temporarily blocked a lower court order requiring the federal government to return an illegal immigrant deported to El Salvador, granting the Trump administration a brief reprieve as it appeals the case.\n\nChief Justice John Roberts entered the stay on April 7, pausing a Maryland district judge’s ruling that ordered the Department of Homeland Security (DHS) to bring Salvadoran national Kilmar Abrego-Garcia back to the United States by 11:59 p.m. on April 7.\n\nThe stay, which will remain in effect pending further action by Roberts or the full court, also requires Abrego-Garcia’s legal team to file a response by 5 p.m. on April 8.\n\nAbrego-Garcia entered the United States illegally in about 2011.\n\nDespite the 2019 ruling, Abrego-Garcia was arrested on March 12 by Homeland Security Investigations, a division of Immigration and Customs Enforcement (ICE). Officials cited what they described as his “prominent role” in the MS-13 gang, which the Trump administration had recently designated a foreign terrorist organization. He was placed on a deportation flight three days later, on March 15.\n\nAccording to ICE official Robert Cerna II, Abrego-Garcia had not been on the original manifest for the flight but was listed as an alternate. As other individuals were removed from the flight, Abrego-Garcia’s name was moved up, and he was added to the final passenger list. The manifest, Cerna said, failed to indicate that Abrego-Garcia had legal protection from removal to El Salvador.\n\n“Through administrative error, Abrego-Garcia was removed from the United States to El Salvador,” Cerna said in the filing. “This was an oversight, and the removal was carried out in good faith based on the existence of a final order of removal and Abrego-Garcia’s purported membership in MS-13.”\n\nAbrego-Garcia’s lawyers have argued that there is no credible evidence linking him to MS-13.\n\n“Defendants have claimed—without any evidence—that Abrego Garcia is a member of MS-13 and then housed him among the chief rival gang, Barrio 18,” she wrote.\n\nXinis also rejected the administration’s claim that the court had overstepped its authority, finding that Abrego-Garcia’s deportation was illegal and that the government could not now avoid responsibility by claiming that it lacked the power to correct the mistake.\n\n“Having confessed grievous error, the Defendants now argue that this Court lacks the power to hear this case, and they lack the power to order Abrego Garcia’s return,” she wrote. “To avoid clear irreparable harm, and because equity and justice compels it, the Court grants the narrowest, daresay only, relief warranted: to order that Defendants return Abrego Garcia to the United States.”\n\nIn its filing, the Trump administration warned of sweeping consequences if the lower court’s ruling were allowed to stand.\n\n“The United States cannot guarantee success in sensitive international negotiations in advance, least of all when a court imposes an absurdly compressed, mandatory deadline,” the government wrote.\n\nThey said the court’s order simply requires U.S. officials to correct their own error—not compel foreign action. They also dismissed the government’s public safety claims, noting that Abrego-Garcia has no criminal record and faces serious risk of harm if left in Salvadoran custody."
  },
  {
    "title": "Swollen Rivers Flooding Towns in US South After Prolonged Deluge of Rain",
    "url": "https://www.theepochtimes.com/us/swollen-rivers-flooding-towns-in-us-south-after-prolonged-deluge-of-rain-5838399",
    "text": "FRANKFORT, Ky.—Days of unrelenting downpours swelled rivers to near record levels across Kentucky on Monday, submerging neighborhoods and threatening a famed bourbon distillery in the state capital.\n\nInundated rivers posed the latest threat from persistent storms that have killed at least 23 people since last week as they doused the region with heavy rain and spawned destructive tornadoes. At least 157 tornadoes struck within seven days beginning March 30, according to a preliminary report from the National Weather Service. Though the storms have finally moved on, the flood danger remains high in several other states, including parts of Tennessee, Arkansas and Indiana.\n\nCities ordered evacuations, and rescue crews in inflatable boats checked on residents in Kentucky and Tennessee, while utilities shut off power and gas in a region stretching from Texas to Ohio. Floodwaters forced the closure of the historic Buffalo Trace Distillery, close to the banks of the swollen Kentucky River near downtown Frankfort.\n\nSalon owner Jessica Tuggle watched Monday as murky brown water approached her Frankfort business. She and her friends had moved her salon gear to a nearby taproom.\n\n“Everybody was just, ‘Stop raining, stop raining,’ so we could get an idea of what the worst situation would be,” she said.\n\nOfficials diverted traffic, turned off utilities to businesses and instituted a curfew in Frankfort as the river crested just short of a record Monday. More than 500 state roads across Kentucky were still closed Monday evening, Gov. Andy Beshear said.\n\nAshley Welsh, her husband, four children and pets had to leave their Frankfort home along the river Saturday evening, abandoning a lifetime of belongings.\n\nWhen she checked her house’s cameras Sunday morning, the floodwaters had risen to the second floor.\n\nA 5-year-old boy in Arkansas died after a tree fell on his family’s home, police said. And a man was found dead in a submerged vehicle, the Arkansas Division of Emergency Management said.\n\nA 16-year-old volunteer Missouri firefighter died in a crash while seeking to rescue people caught in the storm. While in Carroll County, Tennessee, an electric department lineman died while working in the storms, state emergency management officials said.\n\nTwo men sitting in a golf cart, a father and son, were killed when a tree fell on them at a golf course in Columbus, Georgia, Muscogee County Coroner Buddy Bryan said.\n\nThe Kentucky River crested at Frankfort Lock at 48.27 feet Monday, just shy of the record of 48.5 feet set there on Dec. 10, 1978, said CJ Padgett, a meteorologist with the National Weather Service’s Louisville, Kentucky, office.\n\nBeshear said more than 1,000 people had no access to water and nearly 3,000 were under boil water advisories. The city of Harrodsburg about 30 miles south of Frankfort said on social media that its water system had to discontinue pumping around midnight because of flood levels on the Kentucky River. By Monday evening, the city’s treatment plant was back to normal operations.\n\nJohn and Phyllis Sower hunkered down about a half-block from the river in their Frankfort home, which had about 4 feet of water in the cellar. A neighbor waded over Monday to bring them flowers on their front porch.\n\n“We are an island in the Kentucky River,” Phyllis Sower said.\n\nIn northeastern Arkansas, Gov. Sarah Huckabee Sanders called the scene “absolutely heartbreaking” around the town of Hardy, which took damage to its city hall and other buildings.\n\nWest Memphis, Arkansas, Fire Chief Barry Ealy told WREG-TV that crews in the flood-prone city have rescued more than 100 people.\n\nIn Dyersburg, Tennessee, Michael Glass had to evacuate Monday to a hotel with his wife, three children and dog after water reached his front door and his entire neighborhood became flooded.\n\n“It’s been a really stressful time,” he said. “When I woke up this morning, the waters came up dramatically. I had to make a choice whether to stay or get out of here.”\n\nA tornado destroyed more than 100 structures in McNairy County, Tennessee, tearing through the town of Selmer with winds estimated up to 160 mph, local emergency management officials said. State officials say severe weather killed five people in the county of roughly 26,100 residents."
  },
  {
    "title": "Coalition Pledges to Crack Down on Illegal Foreign Fishing",
    "url": "https://www.theepochtimes.com/world/coalition-pledges-to-crack-down-on-illegal-foreign-fishing-5838394",
    "text": "The Coalition has promised to clamp down on illegal foreign fishing to protect the local industry if it wins the May federal election.\n\nThis comes amid a significant increase in such activities off Australia’s coast in recent years.\n\nIn its election plan to support Australian fisheries, the Coalition criticised the Labor government for allegedly allowing illegal fishing to flourish under its watch.\n\nIt also stated that if elected, a Coalition government led by Peter Dutton would review Operation Lunar, a task force aimed at enhancing surveillance and enforcement against illegal foreign fishing in the Northern Territory, and related biosecurity activities undertaken by the Australian Fisheries Management Authority (AFMA) and Australian Border Force.\n\nThis is to ensure that these agencies have the capability to crack down on illegal fishing occurring in Australian waters.\n\n“We will seek to prosecute illegal fishers onshore where appropriate,” the plan read.\n\nWhile the latest figure was well below the 2021-22 record of nearly 350 vessels, it was still many times higher than the 10-year average of 20 vessels, as reported in 2022-23.\n\nIt said high levels of illegal fishing were concentrated in Australia’s northern waters, particularly in the Kimberley Marine Park.\n\n“Many of the drivers behind the increase in illegal foreign fishing are beyond the scope and control of [the] AFMA,” it said.\n\n“Illegal fishing by foreign fishing vessels, mainly from Indonesia, but also from Papua New Guinea in the Torres Strait remains a high priority for AFMA and a key risk to fisheries and the marine environment.”\n\nRecently in late March, the AFMA reported that 11 Indonesian nationals pledged guilty to illegally fishing in Australian waters in two separate cases.\n\nAuthorities seized a total of 1.3 tonnes of sea cucumber, a high-value seafood that can fetch up to thousands of dollars a kilo in some markets.\n\nSpecifically, the recent 2025 federal budget set aside $1.7 million for the AFMA to help the agency combat the growing threat of illegal fishing in Australia’s northern waters.\n\nIn January 2025, the Labor government launched the Operation Lunar task force and allocated an extra helicopter to the Border Force to strengthen the protection of Australia’s fisheries in the Northern Territory.\n\nBefore that, Environment Minister Tanya Plibersek announced the expansion of the Heard and McDonald Islands Marine Park by 310,000 square kilometres in October 2024, which resulted in the marine reserve quadrupling in size.\n\nAccording to the government, this measure will contribute to Australia’s marine conservation efforts and the fight against illegal fishing."
  },
  {
    "title": "China Refuses to Budge After US Threatens Extra 50 Percent Tariff",
    "url": "https://www.theepochtimes.com/china/china-refuses-to-budge-after-us-threatens-extra-50-percent-tariff-5838371",
    "text": "Beijing on Tuesday criticized President Donald Trump’s threat to impose an additional 50 percent tariff on Chinese imports in response to China’s retaliatory measures against the U.S. reciprocal tariffs.\n\nThe Chinese Commerce Ministry said it would be a mistake if Trump proceeds with the extra tariffs and vowed to “fight to the end” to protect its interests.\n\nTrump warned that he would impose additional 50 percent duties on Chinese goods if China refused to withdraw its 34 percent retaliatory tariffs on U.S. imports. Beijing’s tariffs were imposed after Trump’s April 2 reciprocal tariff announcement, which raised the total U.S. tariff on Chinese imports to 54 percent.\n\nThis is a developing story and will be updated."
  },
  {
    "title": "Appeals Court Rejects Trump Admin’s Bid to Fast-Track Deportations to Third Countries",
    "url": "https://www.theepochtimes.com/us/appeals-court-rejects-trump-admins-bid-to-fast-track-deportations-to-third-countries-5838334",
    "text": "A federal appeals court has denied the Trump administration’s request to lift a temporary restraining order blocking the government from fast-tracking the deportation of illegal immigrants with final removal orders to new countries without first giving such individuals a chance to raise claims that they would face persecution or torture if sent there.\n\nIn his March 28 ruling, Murphy concluded that the government must provide individuals with written notice and a meaningful opportunity to apply for protection under U.S. law, including the Convention Against Torture, before deporting them to third countries with which they have no established ties.\n\nThe Justice Department, in its emergency motion, argued that the court had exceeded its authority by imposing new procedural obligations on the executive branch and interfering with the administration’s statutory authority to carry out removals.\n\n“The district court has usurped core executive powers and imposed tremendous practical effects on the President’s authority to manage foreign affairs, including with allies who may wish to accept aliens who are not citizens,” DOJ attorneys wrote.\n\nThe DOJ also pointed to a new directive issued by DHS in response to the district court’s ruling. That guidance requires that any country receiving a deportee under such circumstances provide diplomatic assurances that the individual will not be persecuted or tortured. DOJ attorneys maintained that, beyond this guidance, illegal immigrants may also raise protection claims through existing administrative channels, such as filing a motion to reopen with DHS, immigration courts, or the Board of Immigration Appeals.\n\n“Plaintiffs focus on the lack of notice regarding the country of removal as if their fear depends on receiving that notice. It does not,” DOJ attorneys wrote, arguing that the administrative process is sufficient and that plaintiffs are seeking relief in district court merely for convenience.\n\n“Defendants assert unfettered authority to deport noncitizens to countries that were not previously designated in immigration proceedings without providing any notice of which country, and thus without any meaningful opportunity to seek protection from persecution or torture in that unidentified country,” attorneys for the plaintiffs wrote.\n\nThey added that a motion to reopen is not a practical remedy for many would-be deportees, especially those who are detained, unrepresented, or unaware of where they are being sent until it is too late to act.\n\nThe Justice Department did not respond to a request for comment on the appellate court’s decision by publication time.\n\nThe case now returns to the district court, where Murphy is expected to hold a hearing on the plaintiffs’ motion for a preliminary injunction in the coming days. The outcome of that hearing could determine whether the restrictions on third-country deportations remain in effect for the duration of the litigation."
  },
  {
    "title": "Day in Photos: Remembering Rwandan Genocide, Flooding in Midwest, and Fire in Paris",
    "url": "https://www.theepochtimes.com/article/day-in-photos-remembering-rwandan-genocide-flooding-in-midwest-and-fire-in-paris-5838236",
    "text": "A look into the world through the lens of photography.\n\nDay in Photos: Remembering Rwandan Genocide, Flooding in Midwest, and Fire in Paris\n\nA look into the world through the lens of photography.\n\n|\n\nApril 07, 2025Updated:April 07, 2025"
  },
  {
    "title": "Why US Has Upper Hand Over Beijing in Tariff Standoff",
    "url": "https://www.theepochtimes.com/china/why-us-has-upper-hand-over-beijing-in-tariff-standoff-5838158",
    "text": "News Analysis\n\nAs reciprocal tariffs on U.S trading partners are set to take effect on Wednesday, President Donald Trump has focused much of his attention on the Chinese regime.\n\nSeveral experts say that while many world leaders will eventually meet U.S. demands after the initial kicking and screaming, Chinese Communist Party (CCP) leader Xi Jinping will not—even with the added ultimatum.\n\n“Xi has sold himself domestically and internationally as the guy standing up to America, and people that want to stand up to America should get in line behind chairman Xi,” Christopher Balding, a senior fellow at the Henry Jackson Society, a UK-based think tank, told The Epoch Times.\n\n“It would be catastrophic for Xi to be seen as caving in to Trump in any way,” he said.\n\nExperts also said the CCP cannot and does not want to give the United States what it wants: for China to control its fentanyl precursor exports and open up its market.\n\nThe current U.S.–China tariff standoff is more than a trade conflict, according to Yeh Yao-Yuan, a professor of international studies at the University of St. Thomas in Houston.\n\n“It’s a more aggressive decoupling because escalated tariffs will cause the bilateral trade to drop further,” Yeh told The Epoch Times. “When the decoupling persists, it will lead to a cold war.”\n\nChina expert Alexander Liao thinks the current situation will eventually become a contest between Trump and Xi. Trump depends on the might of the U.S. economy, while Xi relies on support from the communist regime’s tight control system.\n\nGiven this, Liao said Xi is disadvantaged because he has little policy room to maneuver.\n\n“Washington has many cards. Beijing has few,” he told The Epoch Times.\n\nWhile China was at the top of the list, it didn’t receive the highest rate. Other Southeast Asian countries that Chinese companies use for transshipping, including Vietnam and Cambodia, received nearly 50 percent levies.\n\nHowever, Balding said that the administration’s real target was China.\n\n“I think they want to be much more aggressive with China, but they want to do it very quietly,” he said.\n\n“They did it almost, in a way, to shield China,” he added, referring to the administration’s approach of announcing sweeping global tariffs so the levy on Chinese goods didn’t stand out as much.\n\nBalding noted that Trump applies tariffs differently to other countries than he does to China. In the case of the U.S. tariffs on other nations, the rates are set to encourage negotiations. However, Balding remarked that the tariffs imposed on China are so high that negotiations are very hard for Beijing.\n\nThree countries were on the receiving end of the earlier 25-percent fentanyl tariffs: Canada, Mexico, and China.\n\nThe two North American countries were exempted from last week’s reciprocal tariffs. The White House said Canada and Mexico will remain on the fentanyl tariff regime and move to the reciprocal tariff regime after they reach a bilateral agreement with the United States.\n\nBy comparison, China received a reciprocal levy in addition to the fentanyl tariffs. Most Chinese imports are now subjected to a more than 60 percent levy; the amount Trump talked about on the campaign trail.\n\nAccording to Balding, such a steep tariff at the start of the negotiation makes it very difficult for Xi to reach any deal. The Chinese leader, he said, would have to make a lot of concessions to the United States—compromises that Xi isn’t willing to give—for Washington to cut the rate by half. Even if that were to happen, the remaining half would still be too high for China to bear, Balding added.\n\n“What does Trump want? It seems to me he is basically saying, ‘Let’s just decouple everything as much as we can from China,’” the expert said.\n\nSince Trump returned to the White House, many of his foreign policies have been directly and indirectly driven by China.\n\n“Basically [Trump] said, ‘I can’t let any part of the world be a place where China or other countries can ship through them,'” Lutnick said.\n\nSecretary of State Marco Rubio visited Panama as part of his first official foreign trip. Shortly after, Panama said it would not renew its agreement with China’s Belt and Road Initiative, a geopolitical platform for the CCP to expand its global influence.\n\nDuring the first administration, Trump took two years to negotiate and sign a “phase one” trade deal with China. Eventually, Beijing did not fulfill its pledge to buy an additional $200 billion in U.S. products over two years.\n\nLiao said the CCP’s strategy is to draw things out. For example, it may take two years to reach an agreement and another year for Washington to discover that Beijing hasn’t made good on its promises.\n\nUnder this cycle, the United States bears the cost of such delays.\n\nThis time around, by imposing the tariffs upfront, Trump has immediately put the cost on Xi, Liao said.\n\nBalding agrees.\n\n“If you want to draw this out for years and years—go ahead,” Balding said, describing Trump’s approach. “We’re going to impose enormous amounts of pain very early on so that if you want to draw it out, you’re drawing out your pain.”\n\nThe U.S. trade deficit with China was about $300 billion last year. That means the negative impact of a 34 percent tariff will be felt much more sharply in China than in the United States.\n\nThat’s partly why Trump has been pursuing critical minerals in Ukraine, Liao said. Eventually, when the prices of these raw materials for weapons and electronics are no longer kept artificially low due to China’s monopoly, he added, more companies will join the processing businesses.\n\nAccording to U.S.-based economist Davy J. Wong, the United States and China are not in a trade war, but a battle for resetting the international trade protocol and even the world order.\n\nFor Xi, the resilience of the communist political system is the key, according to Liao. Chinese people will become poorer and more dissatisfied. However, if the communist apparatus keeps a lid on the people, Xi could hold out.\n\nTrump’s pain would come from the U.S. economy, Liao said. If the economy can survive the initial shock and voters don’t lose patience with Trump, he can remain focused on standing firm against the CCP.\n\nThe U.S. stock market experienced large drops last week, driven mainly by the uncertainty of the global reciprocal tariffs. With the biggest three-day decline since the summer of 2020 during the COVID-19 pandemic, more than $6 trillion in value evaporated in the equity market.\n\nThe stock market upheaval has added pressure on the White House and Trump, who has often credited the administration’s work for the rise of the stock market.\n\nBalding said Trump will most likely hold out while the stock market adjusts because the U.S. government is prioritizing national security, which is different to Wall Street’s focus on business profits.\n\nThe president has also tied the U.S.–China trade imbalance to national security, saying that Beijing uses its massive surplus with the United States to fund the military.\n\n“We don’t want that. I don’t want them to take $500 [billion], $600 billion a year and spend it on their military,” Trump said in the Oval Office on April 7.\n\nBoth Balding and Yeh believe that if Trump can negotiate agreements with key countries—such as Vietnam, South Korea, and Japan—to significantly reduce tariffs within the next month, businesses will gain more certainty. This would contribute to stabilizing the stock market.\n\nWashington holds more cards, Liao said.\n\nIn addition to further hiking tariffs, Liao said the United States could apply more pressure to the CCP by uniting with China’s neighbors who don’t like the regime, such as Vietnam and India. The United States could also take a human rights approach and release a report about the origins of COVID-19 or publicize evidence of the forced organ harvesting of prisoners of conscience and ethnic minorities in China.\n\nAndrew Moran and Luo Ya contributed to this report."
  },
  {
    "title": "US: China to Face 104 Percent Total Tariff If It Doesn’t Stop Retaliation",
    "url": "https://www.theepochtimes.com/epochtv/us-china-to-face-104-percent-total-tariff-if-it-doesnt-stop-retaliation-5838302",
    "text": "President Donald Trump is upping his tactics to counter the Chinese regime. He says an extra 50 percent tariff will take effect this Wednesday if Beijing doesn’t pull its retaliatory tariff on American goods. Taiwan’s president said the island would not retaliate against U.S. tariffs. We have details on Taiwan’s plan to reduce ..."
  },
  {
    "title": "Shen Yun a ‘Wonderful, Deep, and Important Artistic Statement,’ Says Retired Ballet Dancer",
    "url": "https://www.theepochtimes.com/shenyun/shen-yun-a-wonderful-deep-and-important-artistic-statement-says-retired-ballet-dancer-5837551",
    "text": "NEW YORK CITY—Frank Dellapolla was blown away by the levels of artistry and technique in Shen Yun Performing Arts.\n\nHaving performed with ballet companies across the country and in Europe and Asia, the retired ballet dancer expressed a deep appreciation for what went into the production and what Shen Yun achieved.\n\n“The artistry is impeccable,” said Mr. Dellapolla after seeing Shen Yun at Lincoln Center on April 6.\n\n“First of all, you didn’t know what to expect. It was something that, you know, you come in, you see the commercials, you see the people outside, but it opens up this whole cultural heritage that you didn’t know existed with the old age in China, and it gives a different perspective on what’s going on over there now, and what’s going on over here, and how it reflects,” Mr. Dellapolla said.\n\n“I’ve performed for decades, and to see these guys out there doing every show, my mom was saying, she was amazed at how they can go on stage and do that so consistently, so precisely, so beautifully. It is a massively ballad, wonderful, deep, and important artistic statement,” Mr. Dellapolla said.\n\nMr. Dellapolla, who has performed at the same David H. Koch Theatre he attended Sunday afternoon as well as the MetOpera theater next door, is married to a ballet dancer and his son is a dancer as well, “so for us, as classical dancers, this is just amazing.”\n\n“Their skills are impeccable, they’re classically trained,” he said, remarking on the beautiful technique he saw. “The feet are beautiful, the women have that incredible extension and the ability to control and move.\n\n“But it’s, you know, you can’t look at just one thing. You have to look at the overall package. The artistry is complete, right? It’s a very complete package,” Mr. Dellapolla said.\n\nHe said the dancers were able to express and project the stories they told, from across thousands of years of Chinese history, so that anyone from any background could understand.\n\nMr. Dellapolla said that what he and possibly many others don’t realize from only watching Shen Yun commercials is that what the artists are sharing is not “only Chinese.”\n\n“It is the expression of a more ancient cultural Chinese sense of Buddhism, religion, heritage, free [from] communism, which I think for a lot of us in this country now is important because this country has become so dry and so devoid of spirituality and too easily taken in by socialism, communism, that they really need to learn how important, how pristine, how deep things were before communism.\n\n“That was one of the better messages in the show, I think. A lot of the people in the West would be surprised because they wouldn’t have that knowledge of what’s coming in. So that comes through on top of the impeccable artistry,” Mr. Dellapolla said.\n\nReporting by Frank Liang and Catherine Yang."
  },
  {
    "title": "‘We’re Privileged to See Something Like This Today’: New Yorkers Support Shen Yun’s Cultural Revival",
    "url": "https://www.theepochtimes.com/shenyun/were-privileged-to-see-something-like-this-today-new-yorkers-support-shen-yuns-cultural-revival-5837253",
    "text": "NEW YORK CITY—Chris Cimino and Edmi De Jesus were thrilled with their first time attending Shen Yun Performing Arts, describing the experience as pure entertainment.\n\n“I think it’s fabulous—it’s beautiful, the music is beautiful, the choreography, the costuming. And I like the interaction with that screen in the back and how well that’s choreographed. It’s really been purely entertainment,” said Mr. Cimino, a meteorologist.\n\n“It’s a combination of beautiful artistry, beautiful storytelling, beautiful music, costuming design. You will be having your senses totally fulfilled and entertained,” he said during intermission. “And this is just the first hour of the show so far. So I’m looking forward to the second.”\n\nMs. De Jesus, a makeup artist, agreed, praising the beauty and quality of the performance.\n\nBefore communism, China for thousands of years was a spiritual civilization, and the Chinese believed their culture was a gift from the divine. But when the Chinese communist regime took power in 1949, it set out to destroy the traditional culture, and this is but one reason Shen Yun is banned from performing in China.\n\n“It’s sort of ‘good conquerors over evil,’ it’s kind of the message I’m getting. And it’s interesting to understand the suppression that’s going on, obviously, in China, and seeing these performances and the history prior to that, and how important it is,” he said.\n\n“And it’s important to express this way. And I feel we’re privileged to see something like this today.”\n\n“It’s gorgeous, it’s really beautiful and really impressive, and sad at the same time that you’re not able to appreciate this [in China],” Ms. De Jesus said.\n\n“I think it just shows us a part of the culture that we never knew. And that we will never get to know unless we see the show,” she said.\n\nReporting by Weiyong Zhu and Catherine Yang."
  },
  {
    "title": "Shen Yun Performs to Full House in Southern California City Despite Fake Bomb Threat",
    "url": "https://www.theepochtimes.com/us/shen-yun-performs-to-full-house-in-southern-california-city-after-bomb-threats-2-post-5837176",
    "text": "New York based Shen Yun Performing Arts, which has consistently faced pressure from Beijing, performed to a full house in Claremont, California, after the venue was evacuated due to a bomb threat that turned out to be false.\n\nShen Yun Performing Arts, a classical Chinese dance company that tours globally, received a bomb threat hours before its last performance at Pomona College’s Bridges Auditorium in Claremont, California.\n\nShen Yun’s mission is to present thousands of years of traditional Chinese civilization that existed prior to the Chinese Communist Party’s takeover.\n\nThe threat email marked one of around 100 targeting the company since last year, aiming to disrupt Shen Yun’s performances.\n\nThough the investigation delayed the performance by about 20 minutes, no theatergoers complained about the wait, staffers at the box office said.\n\nIn the packed theater, as the emcee thanked the audience for their patience, saying they’d remain steadfast amid the ongoing intimidation, the spectators broke into applause.\n\nLinda Ross, a first-time viewer of the show, said it was an “honor” to see the performance.\n\n“It’s a shame that something like this has to happen,” she told The Epoch Times about the bomb threats while waiting to enter the auditorium. She had heard about many similar threats prior to coming to the performance, she added.\n\n“This would never stop me to want to see this show.”\n\nJohn Garcia, who stood next to her, said the disruption didn’t bother him at all.\n\nShen Yun is “a beautiful show,” he told The Epoch Times.\n\n“They’re sharing a message,” he said, and “it shouldn’t be suppressed.”\n\nShen Yun, founded in upstate New York in 2006, said it believes the email threat was part of a campaign directed by the CCP, after experiencing many other forms of disruption efforts linked to the Chinese regime.\n\nAround an hour before the Claremont show was due to start, security officers observed an Asian man with a camera hanging from his neck. The man, wearing black, stood across the road from the Shen Yun tour bus and took photos, the officers said. He ran off when security approached him.\n\nThe show organizers in Los Angeles said they are looking at legal options to address the threats.\n\nJoseph Bodner, a retired detective sergeant from the nearby Redlands city, said he appreciated the performers’ artistry.\n\n“It was just the absolute precision,” he told The Epoch Times after the performance. “I’ve never seen anything quite like that.”\n\nIn the battle over values, Bodner said, bad actors tend to intimidate through fear. He’s optimistic that “good is always going to triumph over evil.”\n\nBill Petro, another attendee, said he was still incredulous at how close the intimidation tactics had gotten to being effective.\n\n“I cannot believe that people are so cruel, but they were trying to do anything to stop this,” he told The Epoch Times, adding that the performance presents the reality in China.\n\nHis biggest takeaway from the show was freedom—the importance of “being free,” he said.\n\nThe Los Angeles bureau of The Epoch Times contributed to this report."
  },
  {
    "title": "‘Why This World Is a Realm of Unknowing,’ by Falun Gong Founder Mr. Li Hongzhi",
    "url": "https://www.theepochtimes.com/falun-gong/why-this-world-is-a-realm-of-unknowing-by-falun-gong-founder-mr-li-hongzhi-5733498",
    "text": "After Mr. Li introduced the practice to the public in China in the early 1990s, an estimated 70 million to 100 million people started practicing. Since then, the practice has spread to more than 100 countries around the world. Despite this, in China, the practice has been subjected to extreme persecution by the Chinese Communist Party.\n\nThen what accounts for this? Here is the reason. The greater universe and the multitude of systems within it had reached the last phase of the cosmic cycle of Formation, Stasis, Degeneration, and Destruction. And as everything headed for the terrifying prospect of final annihilation and oblivion, the Creator decided to endeavor to save all lives.\n\nThe reason the greater universe and the numerous universes within it had reached the stage of Destruction is because they as well as the countless lives within them—including the many lords, sovereigns, and divine ones in each of the universes—had become, over the very long course of the Formation, Stasis, Degeneration, and Destruction cosmic cycle, inferior to how they were during the early days of the Formation stage. Or to put it another way, after all of those ages, they no longer met the standards for their respective planes. This was the inevitable trajectory of the course of existence.\n\nAnd so, for the purpose of rescuing lives, the Creator made a world outside of the greater universe. It would be utilized to save the innumerable lives of the greater universe, and was called the “Three Realms.” Within the Three Realms, there are three planes of existence. The beings in the lowest of the three are powerless and without higher insight or wisdom, existing in an environment that is the most taxing and difficult to see through. And that is the human world. The people and beings in the second plane surpass only humankind in insight and wisdom, so they can see only how things are in the human realm and where they themselves are. Humans have referred to them as “heavenly beings” or “demigods.” The beings that are yet one plane higher can see how things are for beings in the two realms below them as well as where they themselves are, and their powers of insight and wisdom are the greatest of all those within the Three Realms. People here in this world have generally referred to these beings as “deities” or “celestial beings.” Yet none of the beings in the Three Realms have the power to see the universe as it truly is, nor to see the kingdoms and paradises where divine beings reside further above.\n\nHumankind thus lives in a state of unknowing, having the least insight and wisdom, and being incapable of seeing the essence of things. This was brought about by the Creator, and it was done in order to allow for beings’ redemption on the eve of the final destruction. It gives them a chance to avoid that fate, as long as they manage to hold fast to the goodness inherent in them, even in this delusory and trying world. It is indeed very hard: The only way to make it through is for lives to endure suffering and work off their karma at a time when lives are slated for elimination during this end point of the Formation, Stasis, Degeneration, and Destruction cycle—and to preserve their innate goodness. Only then will they be deemed “worthy of the future.” When the final cosmic phase arrived, the Creator gave his approval for the greater universe’s multitude of divine beings, sovereigns, and lords—and the still more massive divine and enlightened beings overseeing each of the greater universe’s different domains—to descend to the world and incarnate in human form. Here, however, all of their higher wisdom, powers of insight, and divine abilities would be sealed off. And in this most trying of places, without their powers or wisdom, closed off completely in a human body, they would have to go through adversity to work off their karma while relying on positive and virtuous thoughts and keeping alive the goodness within. Only then would they be acknowledged by the legions of divine ones above as well as the Creator, and earn a place in the future. Those who have managed to gradually work off their karma over the course of their many incarnations in this world, and who have grown in virtue and goodness along the way, are sure to be chosen for salvation. They will certainly be delivered by the Creator to the new universe when salvation unfolds at the end of the last days. What this means is that the state of ignorance and unenlightenment in which humankind lives is part of a unique world and way of existence that was made to be such by the Creator for the purpose of redemption. That is why any attempts by a human to ask another being to shatter this state of unknowing would prove futile. No beings in this world or beyond would dare to undermine this setting that was made for salvation.\n\nThere are always those in this world who consider spiritual beliefs to be unfounded. So some say that they only believe in what they can see, and don’t believe otherwise. As a result, some people do wrong without any concern for the consequences. If a divine being, however high his stature, incarnates as a human—for having a human body means one is human—he will assume the human state of unknowing, along with his human body. And so some, being in this state, create karma here. The reason the Creator made the Three Realms was for beings to diminish their sinful karma by experiencing adversity, with the essential purpose being the elevation of their moral level. Only a being free of sin or karma can be delivered home to Heaven. And the principles of the greater universe dictate that karma must be paid for. Human beings live in a state of ignorance, and so they are apt to create sinful karma in this human realm. And naturally, it must be paid for. If it isn’t paid for in one lifetime, it must be in the next. Many people have an enormous amount of sinful karma, in fact. And so the Creator has borne some of their suffering for them, so that they may gain salvation. This is the greatest form of compassion, and the greatest form of love, for these lives. The fact is, a person’s life will truly be extinguished if his karma amasses to a certain point. So the real purpose of your coming to this earth was to work off all of your karma and thus be able to return to Heaven. When each person incarnated into this world, they made a vow to the Creator. Yet it is of course hard to pay for one’s karma. Karma makes people contend and fight with one another, and it causes war, disease, toil, hunger, poverty—and thus pain and suffering. Some have more karma, and some less. And this is why there are both rich and poor in this world. If one can stay good and kind even in this state of unknowing, one will create less karma! And life will be easier!\n\nAll of this is to say that people’s state of unknowing was made this way for their salvation, and to save the greater universe and vast numbers of universes. Since there are such incredibly significant reasons behind this state, the spell of delusion absolutely cannot be broken to suit human wishes. Some may wonder why the many supernatural beings on this earth don’t do as man desires and lift the veil. The fact is, they wouldn’t dare! That is because it was made to be this way by the Creator for the purpose of saving the greater universe and the multitude of beings. It is to allow for the redemption of these lives!\n\nTeacher Li Hongzhi"
  },
  {
    "title": "‘A Wake-Up Call,’ by Falun Gong Founder Mr. Li Hongzhi",
    "url": "https://www.theepochtimes.com/falun-gong/wake-up-by-falun-gong-founder-mr-li-hongzhi-5665020",
    "text": "After Mr. Li introduced the practice to the public in China in the early 1990s, an estimated 70 million to 100 million people started practicing. Since then, the practice has spread to more than 100 countries around the world. Despite this, in China, the practice has been subjected to extreme persecution by the Chinese Communist Party.\n\nA rather serious issue is that some of you are often making personal attacks on important figures in government. But we are here to help people elevate spiritually and deliver them from danger, not make enemies. Truth be told, you shouldn’t be launching personal attacks on anyone, no matter how bad the person may be (with the exception being the Chinese Communist Party’s sinister, now-deceased despot, Jiang)—and particularly not on important figures in the United States’ two major political parties. Everyone is here for the Way, and all, on some level, are awaiting deliverance from this world. Yet personal attacks tend to breed strong resentment. And once that kind of intense feeling has formed, it is hard to undo. So how are you going to get through to people, in that case? And what’s more, doing that is likely to cause retaliation. Haven’t there been plenty of lessons along these lines? Most of us are outsiders here, and we aren’t deeply rooted in this society. We came here to escape persecution by the CCP, moreover. So we should be grateful, for the United States has opened its arms to us.\n\nWhen you write or speak, you should do so with the intent to help others elevate spiritually, and do so with love for your fellow man. Every Dafa practitioner—and not just those in the media—should ask themselves whether they are doing what someone who does spiritual practice in Dafa ought to. I can’t help but feel worried, looking back at how you’ve done. Many people have been lax in their spiritual practice for quite some time, and have been going about things just like anyone else in the world. That is hardly the spiritual state of someone who practices Dafa, right? You really need to take this problem seriously. Many of you who are involved in various media platforms need to start connecting your work with raising awareness and helping to free people from danger to their souls. If your only aim is to increase your click rate, that’s hardly the spiritual state of a Dafa practitioner. You are wasting large amounts of the limited time that is meant for rescuing people in these final days! You are going to regret that one day! A Dafa practitioner’s responsibility is to bring people out of peril, but if you carry on like this, your compassion is going to completely wither away! How is that anything like someone who leads a spiritual life? Think about the things that have happened: How could they not be related? There are higher beings protecting Dafa practitioners. When things go wrong, isn’t it a divine warning? Why haven’t you snapped out of it? And if something goes terribly wrong, isn’t it a matter of divine punishment? If you no longer have compassion in you, if you’ve lost sight of your responsibilities and mission, and have even forgotten about your spiritual goals, then you are bound to be just like everyone else in this world. And if the lines between Dafa practitioners and others are blurred, what will become of you as a group? Is that not frightening? And yet we are beings shouldering the greatest responsibility in the universe!\n\nI have always taught that you should not be involving yourselves in politics in the role of a Dafa practitioner, nor get involved in rivalries between political parties. The Democratic Party and the Republican Party are both just worldly entities. Every individual is someone whom the divine wants to save from this world. You have no business thinking that you will only try to help individuals who belong to one political party, and not the other. They are all my people! I as well as multitudes of divine beings wish to save them! It’s a different story, of course, if on some level a person doesn’t want to be saved. But as Dafa practitioners, you cannot pick and choose. Each and every person is divine by nature, and everyone came to this earth to learn about Dafa and gain deliverance.\n\nAlso, when you are commenting on things [with your media platforms], you should focus your discussion on the matter at hand, not on the individuals involved. Perhaps some individual handled something wrong in some regard, but is great with things in other regards. Some people’s thinking and beliefs are rather different, but it doesn’t mean they are bad people. To be able to regard anyone and everyone with compassion, to have love for all people, really isn’t something the average person can achieve. Harder still is it to have a sense of compassion toward all living things in everything you do. But that is something practitioners of Dafa have to be able to do! Spiritual development is a process, and so what I described might not be doable at the moment for those who are newer to the practice; but with time, as you develop further in your spiritual practice, you must manage to do that. Veterans of the practice need to do this now. This is something dictated by your historic mission, and it is something that every Dafa practitioner who aspires to spiritual greatness must achieve in their practice!\n\nYour Teacher, Li Hongzhi\n\nJune 6, 2024"
  },
  {
    "title": "‘The Ordeals Our Spiritual Discipline Faces,’ by Falun Gong Founder Mr. Li Hongzhi",
    "url": "https://www.theepochtimes.com/falun-gong/the-ordeals-our-spiritual-discipline-faces-by-falun-gong-founder-mr-li-hongzhi-5663316",
    "text": "After Mr. Li introduced the practice to the public in China in the early 1990s, an estimated 70 million to 100 million people started practicing. Since then, the practice has spread to more than 100 countries around the world. Despite this, in China, the practice has been subjected to extreme persecution by the Chinese Communist Party.\n\nOrdeals have been wrought upon our practice since 1999, when they began in China, and have never ceased, be it in the United States or elsewhere in the world. When you try to save beings, the karma they made over their past lives gets triggered, and demonic entities will likely make use of it to cause disruptions and do harm anywhere, anytime. While Dafa practitioners follow their teacher and strive to save lives, they are working toward their own spiritual liberation and working off their own karma. Demonic entities try to exploit Dafa practitioners’ karma, however, and to block their efforts to save lives. Since those who are being saved cannot atone by themselves for all of their sins and karma from the past, divine beings have to compassionately absolve them of a portion of these, while leaving a portion for them to bear for themselves. I have to bear a portion of it for them, too. And so the more lives that are saved, the more I have to endure. You yourselves will meet with adversity if you are even just a little bit careless as you work to end the persecution.\n\nThe trouble that the practitioner-founded media company is now facing mainly owes to practitioners not doing well, though factors from other dimensions are also at work behind the scenes. You were thinking that it’s hard to fight the CCP’s persecution without funds, and wanted to make money for this cause; and that the U.S. government would be understanding if something wasn’t handled quite right. But that was your own thinking. You thought that it would be justifiable since you were using that money not for other ends but to fight the persecution, given that live organ harvesting is happening and people are dying from the persecution every single day. But you mustn’t forget that Dafa practitioners need to always act with integrity, or there will be problems.\n\nI know that in fact 15 percent of the karma still remains to be dealt with as we go about saving lives. That is what’s left after 20-some years of working to save lives. It is a huge amount, I know. And for this reason, things that spell enormous pressure for me, as well as burdens for me, will keep coming, one after another. Saving lives is difficult; it’s not as simple as it sounds. And that is why we are even seeing those saints in Shen Yun Performing Arts who are saving lives being plotted against.\n\nOur Dafa practitioners have been up against the CCP’s evil, enormous, and fierce propaganda machine, and they have seen the regime use the force of an entire nation to attack them in every aspect of their lives. The Dafa practitioners outside of China are few in number, so those who are parents have found ways for their children to help combat the persecution. To effectively support this cause, Fei Tian Academy of the Arts and Fei Tian College have seen to it that their students not only do well at academics, but also develop into artists who counter the persecution in nonviolent ways. They have shown the world what China was like before communism, helped people to see the CCP for what it is, exposed the persecution, and conveyed the message that the Divine is saving lives in the end times. During the performances, positive energy is used to dispel the adversity that people have in store for them, and this has benefited Americans along with the rest of the world. So each member of the Dafa community has been engaged in countering the persecution.\n\nIn China, all practitioners, children and adults alike, have been subjected to ordeals. Even young children have been imprisoned or died as a result of the persecution. Shen Yun gives some students a chance to perform with the company through a practicum arrangement. Their parents had hoped that they might be able to help combat the persecution while getting their education, and that was why they sent them to Fei Tian. During the admissions process, students have always been asked by the school why they wished to attend Fei Tian, and they have invariably responded that they wanted to help their teacher in the cause of saving lives. They yearn to one day perform with Shen Yun, expose the CCP’s persecution, and help rescue their brethren in China. All of us, young and old alike, feel a sense of responsibility for saving lives and countering the persecution. Some of the younger students are remarkably determined, in spite of their age. Working against the persecution is what we strive to do in our spiritual community. There is no government or corporation doing this alongside us. Be that as it may, there are still people trying to incite others to go after Shen Yun by claiming that young students who are minors are being used as performers, when they are in fact just participating in their practicum studies. It is only natural that all members of our community have felt compelled to do their part to counteract the persecution, given its unprecedented nature. If those are grounds for going after Shen Yun, then what has America come to?\n\nThe truth is, we shouldn’t expect to not face ordeals as a spiritual discipline just because we are in a certain location; it’s just that they assume different forms. And during these ordeals, lives are being chosen to either remain or be sifted out in the end, and just as much is at stake for our Dafa practitioners.\n\nYour Teacher, Li Hongzhi\n\nJune 5, 2024"
  },
  {
    "title": "Article by Falun Gong Founder Mr. Li Hongzhi",
    "url": "https://www.theepochtimes.com/falun-gong/falun-gong-founder-mr-li-hongzhi-publishes-why-creator-seeks-to-save-all-life-5201909",
    "text": "Mr. Li is a four-time Nobel Peace Prize nominee and was nominated by the European Parliament for the Sakharov Prize for Freedom of Thought. He is also the recipient of Freedom House’s International Religious Freedom Award.\n\nDuring this final phase of the cosmos’s Formation, Stasis, Degeneration, and Destruction cycle, the Creator spent 200 million years making the Three Realms as well as planning and putting in place the many ways and opportunities by which lives could be saved, all the while laying a foundation for humanity’s culture, thought, and conduct. He furthermore used His own divine body to reduce and resolve the sinful karma of the multitude of lives! He has given everything of His in order to save all life.\n\nOver the course of those 200 million years, the Creator reincarnated with multiple bodies, countless in number, and laid the foundation for humanity’s culture in this world while overseeing and guarding humankind’s morals; this was done so that people might, one day—when, during the End Times, the age of salvation would come—meet the standard set for them by divine beings. People’s souls have reincarnated repeatedly over the long and drawn-out ages of history, and spent tens of millions of years in waiting. Over time, the true bodies of the souls of most of the world’s people (and this holds true for all ethnicities and races) established some form of familial tie with the Creator. This led the Creator to love the world’s people, His people, only more. With the arrival of the End Times, it became forbidden for lives without such a tie to become human; this was done so as to ensure that the task of salvation could be better fulfilled. By that time, the true bodies of the people on this Earth were all those of His people. And so too were the divine beings that people believe in, who incarnated as human beings and served to impart spiritual teachings. Their mission was to, while assuming human form, lay the cultural foundation intended by the divine for man’s salvation, in the end, by the Creator. The virtuous and authentic religions they left to this world have carried on in order to uphold morality as people await their eventual salvation by the Creator. The Creator has the right to love His people, and His love is even greater for those He deems befitting of love. He is entitled to do so, and no one or no entity has the right to intervene! That is His supreme grace toward these lives!\n\nThe Creator is the Lord of all divine beings in the Cosmos. He is the maker of the Lord of lords, of the King of kings, and He is the sovereign of all lives—including the Three Realms’ human lives, spiritual beings, and material things, all of which He made. His love is the highest and most sacred blessing for all lives! There is no greater honor for any person in this world than to be loved by Him!\n\nTeacher Li Hongzhi\n\nApril 17, 2023\n\n***"
  },
  {
    "title": "Falun Gong Founder Mr. Li Hongzhi Publishes ‘How Humankind Came To Be’",
    "url": "https://www.theepochtimes.com/falun-gong/falun-gong-founder-li-hongzhi-publishes-why-do-human-beings-exist-5000952",
    "text": "After Mr. Li introduced the practice to the public in China in the early 1990s, an estimated 100 million people started practicing. Since then, the practice has spread to more than 100 countries around the world.\n\nDespite this, in China, the practice has been subjected to extreme persecution by the Chinese Communist Party (CCP). This includes a campaign of hate propaganda and censorship by the CCP, both in China and in the West. The Epoch Times, on the occasion of the Chinese New Year, is honored to provide a platform to Mr. Li.\n\nMr. Li is a four-time Nobel Peace Prize nominee and was nominated by the European Parliament for the Sakharov Prize for Freedom of Thought. He is also the recipient of Freedom House’s International Religious Freedom Award.\n\nNew Year’s would normally be a time for sharing a few pleasant remarks about the occasion. But I am seeing imminent danger approaching humanity, and have been called upon by divine beings to pass along, for this reason, several things to everyone in this world. Each of what I am about to disclose is a higher, closely guarded secret, and these are being shared to provide a true picture of affairs, and to give people another chance at salvation.\n\nFirst is the question of how humankind came about. From the dawn of its creation to its final days, the universe has gone through an exceptionally long passage of time consisting of four stages: Formation, Stasis, Degeneration, and Destruction. When the final point of the Destruction stage is reached, the complete obliteration of everything in the greater cosmic body—which includes the universe in which we exist—takes place instantaneously, and all living things perish!\n\nWhen a person dies, it is just a matter of his physical body declining and breaking down, while his true soul (which is who he really is, and which does not die with the passing of his physical body) will continue on in a next life, being reborn. So just as the universe goes through formation, stasis, degeneration, and destruction, so too do human beings go through birth, aging, illness, and death. These are laws of the universe, to which even higher beings are subject, only the time span is longer, with the process being more drawn out in proportion to how great the beings are. Life and death are not painful for them, and they remain cognizant throughout these processes—to them, it is as if but changing outfits. Put differently, normally, lives do not really die. When the universe and the cosmos disintegrate at the final stage of the Formation-Stasis-Degeneration-Destruction process, however, lives will not be reborn, and there will be no more existence of life or matter, with all turning to dust and there being only emptiness. Currently, the human world is experiencing the last period in the Destruction phase of the Formation-Stasis-Degeneration-Destruction progression. Everything has changed for the worse in these end times, as fated, and destruction is thus imminent. And it is for this reason that the world is so troubled. Good thoughts are rare, people’s minds have become twisted, debauchery and drug abuse are rampant, and people subscribe to atheism. These are inevitable in the last stage of the cosmos, and bespeak of the time at which we have arrived!\n\nThe Creator cherishes all of the heavenly beings that exist as well as all of the lives that are good and kind, and all of the glorious creations in the cosmos. So at the beginning of the Degeneration stage, the Creator led a number of divine beings to the outermost plane of the cosmic body (known generally as “that which is outside the Divine Realm”), a place where there are no divine beings, and created Earth. But Earth hadn’t the capacity to exist independently; it needed for there to be a corresponding cosmic structure with which it could form a circulatory system involving life and matter. For this reason, the Creator made a larger expanse outside of the Earth, which higher beings refer to as the “Three Realms.” Before the final time of salvation arrived, no higher beings, however great, would be allowed to enter or exit this expanse without the Creator’s permission. The expanse of the Three Realms comprises three major realms: the Realm of Desire (yu), which is made up of the lives on this earth, including humankind; a second realm, the Realm of Likings (se), which is above it; and a third realm, further above, known as the Realm Without Likings (wu se). Each successive realm is higher and more glorious than that below it, though none can compare to the Divine Realm or the many heavenly kingdoms still higher. The “heaven” that people normally refer to is in fact within either the Realm of Likings or the Realm Without Likings, within the Three Realms. Each of the Three Realms has 10 planes within it, making for a total of 33 planes in all, if you include the Three Realms themselves. Human beings reside in the Realm of Desire, and this is the lowest of all planes, with the worst environment. Life is painful and short here, but more dreadful still is the fact that in the human world, few of the things people take to be truths are actually valid. What human beings hold to be true is on the whole considered the opposite in the larger universe (but an exception is the higher truths that holy beings have taught to man). For example, the divine does not consider it right for whomever is victorious in battle to become ruler, for territory to be seized by military force, or for the powerful to be seen as heroes, since killing and forcefully taking from others are involved. That is not the way of the universe, nor how higher beings go about things. Yet in the human world, these are inevitable and accepted. Those are the ways of the human world, but they are contrary to the ways of the universe. Thus, if a person wishes to return to heaven, he must follow true, higher laws and work on himself. Some people are content when they are doing a bit better in life than others. But such people are only comparing themselves with other human beings within this human realm, when everyone here is in fact living in what is considered to be the trash bin of the universe. The Three Realms were established at the outermost perimeter of the cosmic body, and everything here is made up of the lowest, crudest, and filthiest of particles—molecules, atoms, and the like. In the eyes of higher beings, this is where the trash of the universe is cast away. They thus regard this plane of molecules as dust or “clay” and see it as the lowliest of places. This is the origin of the belief held in some religions that man was made by the divine out of clay. Man was indeed formed out of matter at the molecular plane.\n\nWhen divine beings made man, they did so at the Creator’s behest, and He instructed them to each make human beings in their own unique image. For this reason, there are the white, yellow, black, and other races. While their outward appearances differ, the souls within them were given by the Creator. And that is why they have common values. The purpose that the Creator had in directing divine beings to make man was to make use of man in the final times when He would offer all lives of the greater universe—including holy beings—salvation.\n\nBut why would the Creator have divine beings create humans in such a lowly and inferior place? It was because, with this being the universe’s lowest plane, it is the most grueling of places, and only when things are trying and painful may a person elevate himself through spiritual practice and shed his or her karma. When a person, amidst painful experiences, still manages to keep kind thoughts, have gratitude, and be a good person, he or she is growing through it. Salvation is a process of ascending from low to high, and so one has to start from the bottom. Life is trying for anyone living here. There are the tensions between people when they are trying to make out better, there is the terrible state of the natural environment, and there is the fact that just getting by in life takes a great deal of thought and effort, to name just a few examples. All of these circumstances provide people with opportunities to develop themselves and lessen their karma. It is certain that going through hardships can help people to atone for their sins and karma. And anyone who manages to stay good-natured amidst painful situations and interpersonal troubles is going to build up merit and virtue and, as a result, will achieve the elevation of his or her soul.\n\nWith the arrival of modern times, the Creator had intended to utilize mainly the human body to save the many lives of the universe. And so the souls originally in the majority of human bodies here were replaced by those of higher beings, who incarnated in them. With a human body, they could reduce their karma and sins by enduring hardship. And in this place that is devoid of truth, they could, by holding fast to the higher truths taught by God and persevering in goodness and kindness, achieve the elevation of their souls. The end times are now upon us; the Heavenly Gate that leads out of the Three Realms has been opened, and the Creator is choosing such beings for deliverance.\n\nEverything in the universe had become impure during the Formation, Stasis, and Degeneration phases, and inferior to when creation was begun. And this is why things are heading for Destruction. In other words, everything in the greater universe has gone bad, the lives of creation are no longer as good as they were in the very beginning, are no longer pure, and all of them have accrued karma and sins. And this accounts for Destruction coming about. This kind of sin is what has been referred to in religious contexts as original sin. So that the universe could be saved, the Creator directed a multitude of higher beings and divine sovereigns to descend to the earth and assume human form in this setting, where they would suffer, elevate, atone for their sins, and forge themselves anew—re-ascending to heaven as a result. (The Creator has been re-making the universe at the same time as saving humankind.) The new universe is perfectly pure and simply glorious. If, in a trying setting like this, a person can still keep his thoughts virtuous; if he can hold his ground against the onslaught of modern values and views, and stick to traditional ones; and if he still believes in the divine in the face of assaults from the atheist and evolutionary camps, then that person will fulfill his purpose: to gain salvation and return to heaven. All of the madness now unfolding in the world was planned as such, for the final phase, by divine beings. Their goal was to test the lives here and see whether they were worthy of salvation, and give them a chance to, in the process, work off their sins and karma while going through difficult things. And all of this was done so that people could be saved and gain deliverance back to heaven.\n\nAll of this is to say that the purpose of people’s lives on this earth isn’t to accomplish something in the world. All of the intense efforts and attempts people make in life, and their drive to get what they want, which can even involve resorting to unscrupulous means, only make people immoral in the end. The reason people came to this world and became human was to atone for their sins and karma, and to make significant spiritual progress. People came to this world to gain salvation. They came and assumed human form to await the Creator and his salvation back to their heavenly kingdom. And while they waited, they built up merit over their many past lives, and that was the purpose of people’s rebirths. The troubled nature of this world is meant to make something great of these lives. Of course, there are some people who, when seeking divine help in times of duress, haven’t been satisfied with the outcome and started to loathe God—even turning against Him as a result. Some have even turned to the demonic, dark side, and committed still further sins and made yet more karma. Those whom this applies to had best quickly come around and beg God for forgiveness, if they are still to have a chance of reaching safety. Everything that happens in one’s life—whether it seems warranted or not—is, in reality, the karmic consequence of what one did in one’s past lives, for better or for worse. The amount of blessings and virtue that one built up in one’s past lives determine what fortune is in store in this lifetime, or perhaps the next. If one lives a blessed and virtuous life now, perhaps it will translate in one’s next lifetime into a high position and salary, or it might translate into different kinds of wealth and fortune. And this would also include whether one has a happy family, or even how one’s children turn out, and so on. This is the fundamental reason why some people are wealthy and others poor, why some hold positions of high rank while others are destitute and homeless. It’s nothing like the diabolical nonsense that sinister communism spouts about equality between rich and poor. The universe is fair. Those who do good are blessed for it, while those who do bad things will face payback—if not in this life, then in the next. For this is an immutable law of the universe! Heaven, Earth, the Divine, and the Creator alike are compassionate toward all lives. Heaven and Earth, just as with man and the divine, were made by the Creator, and it is never the case that He plays favorites with some lives and shortchanges others. The reason some people lead happy lives and others do not all comes down to rewards and retribution for past deeds.\n\nWhen you see people winning or losing in life, it appears to come about in a normal way from things in this world. But it is ultimately the karmic consequences of those people’s past doings. Whether people have something or not, or are winning or losing in life, is going to play out in ways that accord with this world. So no matter whether you are rich or poor in life, you should be sure to do good, refrain from doing bad things, stay good and kind, be spiritual and devout, and be happy to help others. And by doing so, you will build up blessings and virtue, and reap their rewards in the next life. In the past, the older generation in China would often talk about things like not lamenting your lot in life when things are hard and about earning a better next life by gaining virtue through good deeds. And the point was that it’s useless praying to God for help if you didn’t do good things in your former life and earn blessings. The universe has its laws, and even higher beings must obey them. Even they will be punished if they do things they shouldn’t. So things are not as simple as people take them to be. Should people expect higher beings to give them whatever they pray for? The prerequisite is that one has to have built up the blessings and virtue for it over past lifetimes. And so the things that come to you are on account of the blessings and virtue you have! This is what the laws of the universe dictate. But speaking on a fundamental level, getting what you want is not the ultimate goal of accumulating blessings and virtue. The real purpose of building those up is to pave the way for you back to heaven. And that is what’s most crucial, not the brief round of happiness that they can bring you in this lifetime!\n\nTeacher Li Hongzhi"
  },
  {
    "title": "Why Is Everyone Wearing Headphones?",
    "url": "https://www.theepochtimes.com/opinion/why-is-everyone-wearing-headphones-5838013",
    "text": "Commentary\n\nSure, I had headphones as a kid, large and puffy, designed to allow me to listen to music in my room without blasting it all over the house. They were fine but I rarely used them because they truly shut out the rest of the world.\n\nIf Mom knocked on the door, I would not hear it. If the phone rang—they were on the wall in those days—I would be oblivious. So I gave it up and stopped wearing them. The cords broke easily. The fashion went away.\n\nPutting things in one’s ears that emit sound has again become this odd cultural habit. It’s understandable given phones these days. You don’t want constantly to be holding it up to your ear, and you don’t want your conversations to be heard by all passersby. So you have earbuds and they are also useful for listening to music and podcasts and so on. I get it.\n\nMore recently, we’ve seen the ubiquity of large and ostentatious headphones, deployed as fashion statements and status symbols. People wear them everywhere. Some people never seem to take them off.\n\nIt’s exceedingly strange and somewhere disturbing and I do wonder what it all means. The masks have barely come off faces—there are still holdouts there—and now we have the popularity of ear masks that truly shut out the entirety of the audible world around the wearer.\n\nWill we ever return to be just fine to go through lives as wholly attentive and open-source people again, with trust in ourselves and others?\n\nTo me, these headphones scream to others: “I hate you and everyone else and want nothing to do with this world.” It’s the ultimate demonstration of aggressive unawareness. These people are shouting that they only want to hear and know what they and they alone want to hear and know. It’s as if they don’t want to be part of the steam of normal life. They want to pretend to be somewhere else.\n\nAs I was typing those words from a chair at the airport gate, an extremely loud buzzer came on. It was so loud that it was painful. The headphone wearers did not notice while the rest of us sat there for 20 minutes while the buzz screamed at us for reasons that were unclear. No one seemed to know what to do about it. Not only that, no one seemed particularly concerned.\n\nIt sounded a bit like a fire alarm but we all instinctively knew it was not that. It was just a thing that happens.\n\nFinally it went off and a pilot sat down next to me. I asked him about the loud sound. He said that it signifies that a door was closed improperly. I asked why it needed to ring out so loudly to everyone even though none of us could do anything about it. He laughed and agreed that it was dumb but that is how the system works. No one can control it.\n\nIt’s odd how filled our lives have become with strange and unavoidable beeps, buzzes, signals, and sounds of all sorts, all emanating from computers and all triggered by some event. When my dishwasher is finished, it beeps not once but fully 8 times. Why 8? It’s what the makers decided. The rest of us have to live with it.\n\nThe door beeps. The TV does too. Even the light switches in my hotel cough up some strange sound when turned off and on, and so does the coffee pot and the door, not to mention the elevator which positively aches with the desire to sound off at every conceivable opportunity. Everything that happens in the hotel offers a sound of some sort.\n\nI’m sure that every mechanic who programmed all these things was proud to add a sound at every change. Maybe they sign their technology the way painters sign canvases, just leaving their mark on stuff to make it clear that they were there. The rest of us live with it forever.\n\nWe are all victims of this constant and unavoidable electronic symphony. Or really, I should say cacophony because it seems like no one thought about the implications of the whole and what effect it would have when interacting with other sounds.\n\nAs a result, we live in a world of unrelenting, seemingly random, and wholly inescapable rackets everywhere.\n\nThere goes another loud buzzer, higher-pitched than the last one and of a shorter duration. What did it mean? Someone surely knows but the question remains. Why must absolutely everyone be subjected to listening to a loud alarm that no one understands and about which all but a handful of people can do anything at all?\n\nWhy is the world set up this way? It seems like a huge mistake.\n\nOf course, the airport is the worst offender by far. Announcements of various sorts never stop and the pauses between them are filled with jazzy saxophone music with an electronic drum beat. Is that supposed to relax us or fill us with a sense of fun? It doesn’t work. If you try to escape to a bar, it too is filled with loud music, on the presumption that we really have not heard enough of music from the 1980s.\n\nPerhaps, then, it is understandable why people wear these “noise-canceling” earmuffs in the airport. This is truly a place where one wants to cancel all noises and plunge deeply into a world of isolation in one’s own solitary mental space while shutting everything else out. I get it, but it is still sad that this should be necessary.\n\nTo be aware of one’s surroundings and attentive to the signs and sounds all around is an evolved trait that was once rewarded. Now it is punished. We are rewarded instead for creating technological isolation chambers.\n\nThe airport is one thing but headphones seem to have become a habit of many people everywhere they go and included with everything they do. It is not only about wanting to shut off unrelenting beeps, buzzes, alarms, and notifications. It is about wanting to leave the world as we know it.\n\nThere is a feature of autism that is characterized by sound sensitivity. Maybe that is part of what is at issue here. The condition affects far more people today than it once did.\n\nAnd yet there is surely more going on. Many people are still feeling broken from the mandatory isolation of 2020-2023 when our communities were shattered, kids were locked out of school, and we could not even gather in our worship communities of choice. We were told to treat others and ourselves as disease vectors, staying always six feet away.\n\nThe new golden age is said to be here but I have my doubts. Or let’s just say that it will be a long time coming. We’ll know that it is dawning when average people feel comfortable and happy enough to take off the masks, remove the headphones, put on something other than sweats and ripped jeans, smile and perhaps speak to others.\n\nWe need really to learn to live where we are—and make our spaces livable again—rather than always wishing we were somewhere else.\n\nViews expressed in this article are opinions of the author and do not necessarily reflect the views of The Epoch Times."
  },
  {
    "title": "Golden Dome: Learning From the Past to Gild the Future",
    "url": "https://www.theepochtimes.com/opinion/golden-dome-learning-from-the-past-to-gild-the-future-5836499",
    "text": "By Peter Mitchell\n\n4/7/2025Updated: 4/7/2025\n\nCommentary\n\nTwo months ago, President Trump directed the development of a national missile defense system initially dubbed “Iron Dome” and rebranded in February as “Golden Dome.” Its stated purpose is to establish a layered and integrated defense shield to protect the United States against ballistic missiles, hypersonic weapons, advanced cruise missiles, and other emerging aerial threats.\n\nThe executive order acknowledges that similar ambitions are not new. It references President Ronald Reagan’s Strategic Defense Initiative, noting that while it “resulted in many technological advances,” the program was ultimately “canceled before its goal could be realized.”\n\nHowever, the current order justifies renewed urgency, asserting that “over the past 40 years, rather than lessening, the threat from next-generation strategic weapons has become more intense and complex.” It specifically cites adversaries’ development of “next-generation delivery systems and their own homeland integrated air and missile defense capabilities.”\n\nSuccess in realizing this monumental undertaking will depend on avoiding past pitfalls while leveraging existing technologies and institutional expertise.\n\nLessons Learned From the 1980s\n\nPresident Reagan’s Strategic Defense Initiative (SDI) of the 1980s—“Star Wars“—sought to create a space-based shield against Soviet ICBMs. Despite its astronomical vision, SDI never fully materialized due to several critical factors: technological overreach, sky-high costs, lack of coordination, and unrealistic goals without clear, phased implementation plans. The SDI called for—among other things—directed energy weapons to defeat enemy ICBMs at a time when such weapons were either embryonic or still in the realm of science fiction. When the INF and START treaties were signed in 1987 and 1991 respectively, the need for SDI quickly faded along with the Cold War.\n\nThe need for missile defense however, did not. The Golden Dome executive order indirectly refers to the SDI when it says, “Over the past 40 years, rather than lessening, the threat from next-generation strategic weapons—including hypersonic—has become more complex with the development of next-generation delivery systems by our adversaries.” Hopefully, unlike Disney’s recent efforts, this Star Wars sequel won’t be a disappointment.\n\nThe key difference between 2025 and 1985 is that much of the technology required already exists and has been battle-tested—most notably by Israel, and to a lesser extent Ukraine. Keep in mind, in the 1980s, the new fielded Patriot wasn’t even rated to reliably engage short-range ballistic missiles, to say nothing of ICBMs. Even anti-satellite weapons were on the very cutting edge.\n\nBuilding on Proven Technologies\n\nGolden Dome is an opportunity to leverage existing, proven defense technologies rather than incurring the massive cost-reimbursement contracts of all-new development. The U.S. has been refining these capabilities over decades through AIAMD, THAAD, Patriot, Aegis BMD, and the Ground-based Midcourse Defense (GMD), along with close, ongoing cooperation with the Israelis. These established systems provide the initial foundation upon which the Golden Dome can build. What is needed is to bring these systems all together with improved short-range sensors, and network them together on a scale like the planned Joint All-Domain Command and Control (JADC2) system.\n\nThe institutional air defense knowledge housed within major contractors like Lockheed Martin and Raytheon represents billions of dollars in prior investment and millions of engineering hours. Additionally, these companies possess large amounts of expertise in large-scale integration projects that will be crucial to the Golden Dome’s success. Their experience with complex command and control architectures gives them unique capabilities to tackle the integration challenges ahead.\n\nLessons in Integration\n\nAmerica’s defense challenges differ substantially from those of our allies and adversaries. But there are still valuable lessons to be drawn from successful past integration efforts. The development of layered defense networks by other nations demonstrates that combining technologies from multiple sources into a coherent system is possible with proper coordination and leadership.\n\nFor Golden Dome to succeed, the DoD must foster coordination between established defense contractors and innovative technology companies that reflect America’s unique strategic position and continental scale. Given the vastly different geographic and threat profile facing the United States, Golden Dome will need to pioneer new approaches rather than attempting to replicate foreign models.\n\nThe Challenge\n\nBill Morani, undersecretary of defense for acquisition and sustainment, noted that Golden Dome is “[both a] monster systems engineering problem [and] a monster integration problem.” The Missile Defense Agency (MDA) has established a phased Golden Dome timeline for capability delivery from 2026 to past 2030. Meeting these deadlines on a project of this scale will require an enormous amount of coordination between government agencies, stakeholders, and defense contractors.\n\nEstablished defense prime contractors offer critical advantages to the U.S. industrial base in this area. Their decades of experience working with the MDA, U.S. Northern Command, the military services and other defense agencies have created institutional knowledge and networks difficult to replicate. These companies understand the complex regulatory environment, certification requirements, and interoperability standards needed to incorporate a defense system this vast. They also bring the ability to manufacture at scale.\n\nAt the same time, tech hyperscalers and defense innovators are essential to the Golden Dome’s success. Microsoft, Amazon Web Services, and Google bring cloud infrastructure and advanced AI capabilities that will be critical for processing the massive data streams required for an integrated defense network. Companies like ShieldAI offer autonomous systems expertise, while Anduril and Palantir bring computational prowess and innovative approaches to data fusion. Their agility and fresh perspectives represent valuable additions to the defense industrial ecosystem.\n\nThe integration of these complementary capabilities is what will make Golden Dome possible. Large prime contractors bring irreplaceable experience in system integration, scaling production lines, and proven hardware platforms, while tech-focused firms contribute cutting-edge AI/software capabilities, cloud infrastructure, and novel approaches to data management needed for next-generation defense solutions.\n\nStarting Small: Guam\n\nRather than beginning with the overly ambitious goal of covering the contiguous United States, Golden Dome would benefit from a focused approach similar to Israel’s incremental development of its multi-tiered defense system. Guam presents an ideal testbed—a crucial and geographically contained area facing substantial threat from China, including thousands of drones and hundreds of cruise missiles and tactical ballistic missiles.\n\nOngoing and previous defense efforts on Guam have provided valuable data. A THAAD battery has been emplaced there since 2013. The temporary deployment of a U.S. Iron Dome battery to the island in 2021 demonstrated both possibilities and limitations of current technology when adapted to Guam’s defense needs. The MDA successfully tested the Aegis Guam System in December of 2024. The U.S. Army is planning on building out the multi-capable Task Force Talon already deployed on the island into a larger Guam Defense System (GDS) task force with improved short-range air and missile defense capabilities. Starting with a fully integrated defense of Guam would provide measurable success criteria, help refine integration approaches and establish protocols that could later be scaled to larger areas such as the National Capital Region, Hawaii, and Okinawa.\n\nThe Way Ahead\n\nGolden Dome needs clear, achievable milestones with tangible benefits at each stage. The defense of Guam represents an ideal first objective—strategically important, geographically defined, and facing concrete threats. Success there would validate the approach before expansion to other critical areas.\n\nThe Missile Defense Agency’s phased approach shows a keen awareness of this need for incremental progress and gates. By leveraging existing technologies and industrial capabilities while incorporating innovative approaches from newer companies, the DoD can maximize returns on taxpayer investment in an era of increasing defense efficiencies while accelerating deployment timelines.\n\nConclusion\n\nThe Golden Dome initiative represents America’s most significant integrated missile defense undertaking since the Strategic Defense Initiative. But unlike SDI, today’s effort benefits from mature technologies, battle-tested systems and proven capabilities, and decades of institutional knowledge within our defense industrial base.\n\nWithout focused leadership and integration expertise, the President’s decree risks becoming like Coleridge’s unfinished poem “Kubla Khan”—a grand vision interrupted. Just as the golden dome of Xanadu existed only as a fragmented vision in a dream, so too might America’s Golden Dome remain incomplete without the right military-industrial partnerships and strategic approach.\n\nFor Golden Dome to succeed where SDI faltered, it must incorporate the solidity of established defense primes with the liquid agility of newcomers, all while keeping costs in check and timelines tight. The DoD faces a daunting challenge, but with Guam as a proving ground and battle-tested technologies as building blocks, the initiative stands a fighting chance of fulfilling the President’s vision: a shield capable of protecting American power projection in an era of proliferating threats.\n\nFrom RealClearWire\n\nViews expressed in this article are opinions of the author and do not necessarily reflect the views of The Epoch Times."
  },
  {
    "title": "Tackling the Department of Defense’s Data Problem",
    "url": "https://www.theepochtimes.com/opinion/tackling-the-department-of-defenses-data-problem-5836602",
    "text": "Commentary\n\nThe Department of Defense (DOD) needs a single source of truth at the enterprise level to pass a full financial statement audit. More importantly, it needs this kind of self-awareness to be a smarter customer, a better manager, a more accountable steward of taxpayer funds and ultimately, to be more capable, ready, and lethal at warfighting.\n\nAs the Deputy and then Acting Under Secretary of Defense Comptroller when DOD underwent its first audit, it was my job to attack the department’s data problem. A look back at the origins of how we did this, by creating the Defense Department Advancing Analytics (Advana) capability, is useful in understanding its future.\n\nPut simply, Advana was to be the desired single source of truth for the Pentagon. It was designed to support the Department’s journey toward a clean opinion on its full financial statement audit. However, that was not the sole intent, and it was also clear from the start that supporting the audit was about much more than financial information and systems. It was about inventory, property, personnel, logistics, contracting, readiness, and cyber security. It was about knowing the defense culture and how to get all elements of the enterprise to willingly and openly share data.\n\nThe Advana vision included an end to time-consuming, unreliable, non-repeatable data calls. An end to arguing about the validity, comprehensiveness and currency of data. No more unanswered management golden questions about program performance and execution, operational readiness or battlefield situational awareness. Nor about the location, condition and quantity of parts, supplies, and equipment. It also envisioned a comprehensive, real-time picture of defense finances and a sophisticated tracking system for audit findings and recommendations, material weaknesses and progress toward a clean opinion. All of these things are related, dependent and necessary in one place.\n\nThe path to doing this involved identifying the most important, yet relatively basic, questions the Department could not easily answer, determining who owned the required data and then showing the benefits—to the data owners—of providing their information to an enterprise system.\n\nSounds easy. It was not.\n\nThings have changed since then, but the original vision remains. Advana has continued on its intended path. It now contains over 700 data sources—reflecting the complexity of the defense information environment that grew up with a warfighting, not a business acumen, focus. It supports more than 55 defense organizations and 76,000 users—with demand that continues to grow. It also has a road of improvement ahead, including infrastructure enhancements to accelerate and simplify use of new AI tools and use cases, application of emerging commercial tools to expedite workflow and support the platform in becoming more flexible, adaptable, and automatic for the decision-maker.\n\nWhile Advana has stayed true to its original vision, continuing to achieve scale requires a strong champion and simplified acquisition strategy that focuses on maintaining reliable and trustworthy data for a clean audit opinion while delivering warfighter outcomes.\n\nBut a few years ago, the team managing Advana was moved from the Comptroller to the new Chief Digital and Artificial Intelligence Office. This move should be reversed. Advana should be moved back to Comptroller with a small government technical team responsible for building Advana’s data inventory, promoting customer outcomes, executing a simplified acquisition strategy, and managing a consolidated budget. The Comptroller has a unique and independent position within the Pentagon. It has a streamlined organization of very senior staff with a direct connection to the components and to DOD leadership. It is by nature focused on frugal stewardship and efficiency. Money—and financial information and systems—is still the key element of data transparency, analysis, and decision-making. But it does not, nor was it ever designed to, stand alone.\n\nThe audit journey is about much more than the ultimate clean opinion. It is about lasting improvements being made to business systems, cyber security, inventory and personnel management, data analytics, operational efficiency and ultimately, the decision superiority that underpins advances in warfighting.\n\nThe Department should continue to support Advana as the ultimate single source of truth as it pursues the clean audit opinion while recognizing that the origin story and vision for the capability was always about so much more than financial accountability. It was, and is, about government efficiency and empowering decision making that is crucial to the future of warfare.\n\nViews expressed in this article are opinions of the author and do not necessarily reflect the views of The Epoch Times."
  },
  {
    "title": "CCP Greatest Threat to US National Security",
    "url": "https://www.theepochtimes.com/opinion/ccp-greatest-threat-to-us-national-security-5835856",
    "text": "Commentary\n\nThe report, produced by the Office of the Director of National Intelligence (ODNI), is an unclassified, comprehensive overview of the most pressing threats to U.S. national security. Compiled by the National Intelligence Council in coordination with the Intelligence Community—an 18-agency federation that includes the CIA, NSA, and FBI—the report outlines dangers ranging from terrorism and transnational crime to state-sponsored cyberattacks and geopolitical rivals.\n\nWhile the report outlines a wide range of global threats, the Chinese regime is again identified as the top national security concern. It has held this position every year since 2019, except in 2022 when Russia briefly took the lead following its invasion of Ukraine.\n\nThe CCP is actively working to displace U.S. military and economic influence both regionally and globally through a combination of conventional military power, asymmetric tactics, and proxy networks. The regime’s cyber capabilities, pressure on Taiwan, and ambitions in artificial intelligence further elevate the threat. Additionally, Beijing is implicated in enabling nonstate actors, particularly Mexican cartels, by supplying chemical precursors and trafficking equipment, exacerbating America’s fentanyl crisis.\n\nThis year, Russia ranks second, driven by its ongoing war in Ukraine and deepening ties with regimes like North Korea. Following Russia is Iran, which is notable for its proxy warfare and nuclear ambitions. North Korea comes next, primarily due to its use of nuclear coercion and advancements in missile technology.\n\nIn addition, cyberattacks pose a growing danger to U.S. national security. Chinese cyber operations specifically target critical infrastructure, financial systems, media, and telecommunications as part of broader espionage and influence campaigns designed to weaken America’s technological and economic edge. These efforts are part of a wider pattern, as China increasingly coordinates with Russia, Iran, and North Korea—forming a loosely aligned bloc engaged in persistent, covert cyber aggression aimed at undermining U.S. dominance without provoking open conflict.\n\nBy 2035, the PLA aims to complete its transformation into an “intelligentized” force, leveraging artificial intelligence (AI), quantum computing, and machine learning to enhance autonomy and decision-making across its operations.\n\nThe long-term objective is 2049, the centennial of the People’s Republic of China, when Beijing seeks to establish a “world-class” military capable of projecting power globally and securing its growing political and economic interests.\n\nIn 2024, the PLA Navy’s third aircraft carrier (Fujian) began sea trials, the Rocket Force likely deployed the DF-27 hypersonic-capable missile, and ground forces enhanced long-range strike capabilities with the PCH191 rocket launcher. The PLA continues modernizing its missile systems, expanding electronic warfare capabilities, and improving readiness and training.\n\nThe Chinese regime is developing missile systems capable of striking U.S. territories such as Guam, Hawaii, and Alaska—and may be exploring conventionally armed intercontinental missiles that could reach the U.S. mainland. Beijing is also working to expand overseas military logistics through a mix of access agreements, co-located commercial and military infrastructure, and permanent bases.\n\nChina’s commercial space sector is also expanding, aiming to compete globally in satellite internet and other services. Militarily, China has developed a range of counterspace weapons—including electronic warfare systems, directed energy weapons, and antisatellite missiles—and has demonstrated capabilities that could support future space-based attacks on U.S. and allied satellites.\n\nIn 2025, the Chinese regime is expected to expand its malign influence operations to weaken the United States both domestically and globally, aiming to suppress criticism, sow division, and counter what it perceives as a U.S.-led campaign against the CCP. These efforts increasingly rely on advanced technologies, including AI-generated news anchors and fake social media profiles, to spread disinformation and exploit divisive issues, such as illegal immigration, illicit drug use, and abortion.\n\nThe 2025 Annual Threat Assessment makes clear that the CCP is not just a competitor but the most persistent and comprehensive threat to U.S. national security. Through military modernization, cyber campaigns, economic coercion, and influence operations, Beijing is executing a long-term, whole-of-state strategy—bolstered by growing alliances with other adversaries—to challenge American dominance across every domain.\n\nViews expressed in this article are opinions of the author and do not necessarily reflect the views of The Epoch Times."
  },
  {
    "title": "US Geopolitical Chess: Strategies Against China, Russia, and Iran",
    "url": "https://www.theepochtimes.com/opinion/us-geopolitical-chess-strategies-against-china-russia-and-iran-5833908",
    "text": "By Yang Wei\n\n4/6/2025Updated: 4/6/2025\n\nCommentary\n\nAs the United States brokers a cease-fire between Russia and Ukraine, the Trump administration’s unique strategies toward China, Russia, and Iran are becoming more apparent. At the same time, the administration is redefining alliances while urging partners to step up their defense instead of depending on America’s traditional generosity.\n\nThis multifaceted strategy aims to reshape the global order by isolating the three adversaries of the United States, with the ultimate goal of delivering a decisive blow to the Chinese Communist Party (CCP).\n\nRussia Strategy\n\nPresident Donald Trump is focused on quickly resolving the Russia–Ukraine conflict by providing Moscow with a way out while maintaining pressure on the CCP, which remains his main target. After taking office, he shifted U.S. policy toward Russia, incorporating a mix of incentives and some level of coercion, with a stronger emphasis on the former. This strategy has yielded positive results, initiating discussions for a cease-fire.\n\nOn Jan. 22, just days into his presidency, Trump posted on his Truth Social platform: “I’m going to do Russia, whose Economy is failing, and President Putin, a very big FAVOR. Settle now, and STOP this ridiculous war! IT’S ONLY GOING TO GET WORSE. If we don’t make a ‘deal,’ and soon, I have no other choice but to put high levels of Taxes, Tariffs, and Sanctions on anything being sold by Russia to the United States, and various other participating countries. Let’s get this war, which never would have started if I were President, over with!”\n\nThe Kremlin responded swiftly. On Feb. 12, Trump and Russian President Vladimir Putin spoke by phone, agreeing to start negotiations right away to halt the conflict, breaking a diplomatic stalemate.\n\nOn Feb. 18, the U.S. and Russian teams met in Saudi Arabia, resuming normal engagement and laying the groundwork for cease-fire discussions. By March 18, a second call between Trump and Putin focused on halting attacks on energy infrastructure. This initiated technical talks regarding a maritime cease-fire in the Black Sea, a broader truce, and a lasting peace deal.\n\nOn March 25, the White House detailed separate U.S. meetings with Russia and Ukraine, securing safe Black Sea navigation and a mutual pledge to spare energy infrastructure. The United States also committed to aiding Russia’s agricultural and fertilizer exports while helping Ukraine recover detained civilians and children displaced by Russia.\n\nThe next steps will likely address issues related to territorial borders, peacekeeping, sanctions relief, and security guarantees. As long as Moscow is cooperative, Trump will prefer to offer incentives. However, if Russia adopts a more rigid position, he is prepared to walk away, compelling the Kremlin to consider its alternatives—especially in light of potential betrayal by Beijing. Trump’s strategy focuses on creating a rift between Russia and China while simultaneously applying pressure on both nations.\n\nChina Strategy\n\nRegarding the CCP, Trump employs a dual approach of intense pressure and selective engagement.\n\nTariffs lead the charge. Citing China’s failure to stem fentanyl flows into the United States, he imposed an additional 10 percent tariff on Chinese imports effective on March 4.\n\nMoreover, G7 ministers, during a meeting in Canada on March 14, issued a statement that hardened their position on the Chinese regime’s trade practices, military expansion, and regional tensions. Notably, the joint statement did not reference the “One China” policy, indicating support for Taiwan’s participation in global organizations. Washington likely influenced this shift.\n\nThese actions rattled the CCP, yet Trump had sought to engage with Beijing.\n\nIn December, the U.S. president invited CCP leader Xi Jinping to his inauguration; however, Xi declined the invitation and sent his deputy, Han Zheng, in his place. The idea of a meeting between Xi and Trump generated significant interest, but it appeared that the White House was merely trying to gauge reactions and test the waters.\n\nOn March 22, Sen. Steve Daines (R-Mont.) visited Beijing, where he discussed the issue of fentanyl with Vice Premier He Lifeng and suggested the possibility of future high-level talks. Later, Daines also met with Chinese Premier Li Qiang, who told the United States to opt for “dialogue” rather than “confrontation.”\n\nYet Beijing’s actions suggest resistance. On March 24, it enacted an anti-foreign sanctions law, signaling defiance.\n\nWashington acted quickly. The next day, the United States added 42 Chinese entities to its export restriction list and imposed a 25 percent tariff on all goods imported from those countries that purchase Venezuelan oil, essentially halting China’s purchases.\n\nBeijing remains resolute in its stance against the United States. A virtual meeting on March 26 between U.S. Trade Representative Jamieson Greer and Chinese Vice Premier He Lifeng resulted in no progress. Additionally, Li Ka-shing’s sale of Panama Canal port rights to BlackRock on March 4 drew late criticism from Beijing, but this response came too late to be of any significance.\n\nIran Strategy\n\nTrump has not overlooked Iran, especially following the country’s naval drills with China and Russia on March 9.\n\nThe U.S. president sent a letter to Iranian Supreme Leader Ali Khamenei in early March, seeking to negotiate a deal to restrain Tehran’s rapidly advancing nuclear program.\n\nHowever, Khamenei rejected direct negotiations with the United States over the issue, saying, “Some foreign governments and domineering figures insist on negotiations, while their goal is not to resolve issues but to exert control and impose their own agendas.”\n\nOn March 15, as the trilateral exercise ended, U.S. forces struck Iran-backed Houthis in Yemen. Defense Secretary Pete Hegseth declared it a warning to Tehran: “An era of peace, through strength, is back.”\n\nTrump followed up with a social media post on March 17, vowing “great force” against Houthi retaliation and holding Iran accountable for arming the terrorist group. Two days later, he demanded Iran halt supplies “immediately,” predicting the Houthis’s swift defeat.\n\nThe strikes served a dual purpose: they sent a message to Beijing and Moscow. Following a meeting on March 14 in Beijing that involved representatives from China, Russia, and Iran discussing Tehran’s nuclear program, Trump’s escalation with the Houthis undermined Beijing’s mediation efforts. As U.S.–Russia–Ukraine discussions progressed in Saudi Arabia, it highlighted Trump’s willingness to pivot against Moscow if necessary.\n\nTrump is playing a different game with China, Russia, and Iran to divide them, aiming to hit the CCP the hardest.\n\nThe Bigger Picture\n\nIn a chaotic, uncertain world, Trump effectively utilizes every available resource. The United States must bring all its resources together to confront the CCP. The sooner America’s allies and partners understand this strategy and offer their support, the faster the CCP will weaken and potentially collapse.\n\nOnce the CCP falls, Russia will lack the means to sustain its war efforts, Iran will find itself without a backer, and terrorist organizations will struggle to survive. Only then can global stability be restored, the international order reestablished, and nations begin to enjoy a peaceful existence.\n\nViews expressed in this article are opinions of the author and do not necessarily reflect the views of The Epoch Times."
  },
  {
    "title": "Startup Success Isn’t a Formula; It’s an Emergent Order",
    "url": "https://www.theepochtimes.com/opinion/startup-success-isnt-a-formula-its-an-emergent-order-5836615",
    "text": "Commentary\n\nSome startup ideas are so obviously bad that no one questions passing on them. Others, though, sit in a strange space — outliers that don’t fit the conventional mold. These are the ones that, at first glance, seem weird but intriguing. Maybe your friends and family think you’re crazy for considering them. Maybe even you hesitate, wondering if you’re wasting your time, because not every outlier is a breakthrough, many are just noise.\n\nIf that doubt was enough to make you walk away, it was probably for the best, not because the idea itself was bad, but because being an outlier felt overwhelming and/or you never truly believed in it. For an idea to have a chance, you need to believe in it long before others do.\n\nThe greatest innovations don’t emerge from a checklist; they arise from an obsession with understanding something that others overlook. If you’re trying to “pick” a startup idea like an investor picks stocks, you’re already missing the point. The best work happens when you follow what fascinates you, not what seems lucrative. If you want to build something meaningful, don’t start with an agenda, start by learning. The best work doesn’t stem from calculated ambition but from curiosity.\n\nWhy do I say that? The moment you start treating an idea like an equation, you’re likely driving it straight into a dead-end. A groundbreaking idea doesn’t emerge from a blog post on startup trends or by asking, “What’s a good startup idea?” Ideas aren’t fish waiting to be caught in a crowded sea.\n\nThis means that breakthrough ideas don’t emerge from deliberate calculation alone — they arise from the spontaneous connections our minds form between seemingly unrelated concepts. When you obsess over a particular problem, your brain works on it in the background, making associations beyond what you can consciously track. What feels like a sudden “aha” moment is often the result of countless micro-processes happening beneath the surface, aligning scattered thoughts into a cohesive insight.\n\nThis is why the best startup ideas don’t arise from forceful ideation sessions but from immersion in a field, an ongoing fascination with a problem, and an openness to discovering unexpected connections. If you feel drawn to an idea without fully understanding why, it might not be randomness — it could be your mind naturally assembling pieces of a puzzle you didn’t even know you were solving. Hayek wrote,\n\n“We can never form a crystal or a complex organic compound by placing its constituent individual atoms in the lattice of a crystal or in the benzole circle of an organic compound. But we can create the conditions under which they can be so organized.” (Hayek, 1973:61)\n\nHayek’s theory of “spontaneous order,” which describes how complex structures emerge organically rather than through central planning, isn’t just an economic insight; it’s a guiding principle for founders.\n\nHayek provides an even deeper insight into why this happens. He argues that the human mind does not process information in a purely logical or algorithmic way. This means that the best ideas are not built top-down; they evolve naturally as our brains make connections between previously unlinked concepts.\n\n“Order with the help of disorder is the rule, and we are a long way from the determinism of classical physics. ” — Ilya Prigogine, Nobel Laureate, Belgian physical chemist\n\nAn idea, much like a market, is not created through sheer force of will. It arises when the right elements interact under the right conditions. Hayek describes this as a “classification apparatus” — our brains are not just passive receivers of information but active processors, constantly categorizing and reinterpreting data based on past knowledge. This explains why the best startup ideas often don’t come when you’re actively searching for them but when seemingly unrelated knowledge and experiences collide in unexpected ways. The mind operates as a decentralized, spontaneous system — mirroring the same principles that drive markets and innovation.\n\nThink of it like a puzzle. Imagine you’re handed 1,000 scattered puzzle pieces without knowing what the final picture looks like. If you try to force pieces together, you’ll only create a distorted image. But if you patiently explore the relationships between pieces, allowing the pattern to reveal itself, the picture gradually takes form. This is how spontaneous order works, both in markets and in idea generation. You can’t dictate innovation through brute force; you have to recognize patterns, piece by piece, as they emerge.\n\nThe biggest breakthroughs often began as side projects, curiosities, or unexpected discoveries. Paul Graham has spoken about this extensively: the best founders aren’t just chasing an outcome; they’re consumed by the question itself.\n\nSo don’t force an idea into existence. But if the process of exploring an idea feels like oxygen, if abandoning it feels like suffocation, you have your answer. The best ideas aren’t discovered; they evolve. The ones worth pursuing won’t let you walk away.\n\nViews expressed in this article are opinions of the author and do not necessarily reflect the views of The Epoch Times."
  },
  {
    "title": "US Broadcasting Into China Needs an Authentic American Voice to Live On",
    "url": "https://www.theepochtimes.com/opinion/us-broadcasting-into-china-needs-an-authentic-american-voice-to-live-on-5836300",
    "text": "Commentary\n\nBoth media outlets are significant sources of information for Chinese people seeking alternative viewpoints to counter communist propaganda.\n\nAs U.S.–China tensions rise and the Chinese Communist Party (CCP) increasingly shows hostility toward the West, the United States will need VOA and RFA’s unique window into China—but not without change.\n\nI still remember how we relied on VOA broadcasting during the 1989 student-led pro-democracy movement. I was in college at the time. Most of China was misled by the CCP’s propaganda, which claimed that not a single student was killed on Tiananmen Square and that so-called bad people who collaborated with foreign anti-Beijing forces were responsible for the deaths of Chinese soldiers. However, those of us who listened to VOA knew the reality was completely different.\n\nRFA was established after the 1989 Tiananmen Square massacre, under the International Broadcasting Act of 1994, to make facts available to Asian countries with limited access to unrestricted media.\n\nTo Chinese listeners at the time, VOA represented the beacon of hope and freedom that America was all about, and RFA was more pro-democracy and anti-CCP. But that’s no longer the case.\n\nOver the years, the CCP narratives have seeped into the organizations’ messages; VOA and RFA have hired many journalists from China.\n\nMy good friend Tang Baiqiao—a well-known political dissident and former student leader in the 1989 pro-democracy movement—used to be a regular contributor to VOA. However, about a decade ago, he discovered that he had been placed on a blacklist by a new manager, who was previously a reporter for Xinhua News Agency. This manager’s father was the chief correspondent for the People’s Daily in the United States during the 1980s and 1990s. As a result of this blacklist, Tang has been excluded from all programs, including one featuring Peter Navarro’s 2011 book “Death by China,” for which he wrote the foreword.\n\nMore and more mainland Chinese faces have shown up in VOA and RFA. Statutorily, the organizations cannot disqualify job candidates by affiliation with the CCP. Hence, top talent from China’s outlets like Xinhua News Agency and Chinese Central Television (CCTV) easily outperformed others in the hiring process.\n\nConsequently, the tones of VOA and RFA have become subtly more favorable to the CCP. Tang describes it as “minor criticism lending a big help.” That is a media category in the CCP’s united front strategy; sometimes, those who appear to be critical of the CCP have more influence and can be used sporadically to assist with critical communist narratives.\n\nSuch Chinese individuals have also infiltrated the management of VOA and RFA. Together with managers with a left-leaning mainstream media background, they can no longer be trusted to expose the CCP’s evildoings.\n\nSuch is the sad reality for their loyal Chinese audience.\n\nOne of the whistleblowers with a journalism background immediately turned pale and fled the room. He knew that overseas journalists from Chinese media agencies were spies.\n\nMany seasoned liberal media journalists end up working at the VOA’s Central News Office, managing the editorial guidelines.\n\nNow, amid rising tensions between the United States and the CCP, the United States must maintain a Chinese-language news platform representing American values.\n\nIn particular, VOA, with its legacy of more than 80 years, has served as a vital soft power asset for the United States.\n\nTherefore, I am cautiously optimistic that VOA and RFA will survive by refocusing on their original missions.\n\nCorrection: A previous version of this article misspelled the name of Tang Baiqiao. The Epoch Times regrets the error.\n\nViews expressed in this article are opinions of the author and do not necessarily reflect the views of The Epoch Times."
  },
  {
    "title": "Hezbollah’s Network on America’s Southern Doorstep",
    "url": "https://www.theepochtimes.com/opinion/hezbollahs-network-on-americas-southern-doorstep-5836537",
    "text": "By Marzia Giambertoni\n\n4/6/2025Updated: 4/6/2025\n\nCommentary\n\nIn the hierarchy of security concerns on policymakers’ agendas, Hezbollah’s presence in Latin America rarely captures headlines. A recent RAND piece—“Hezbollah’s Networks in Latin America”—finds that this oversight may prove increasingly costly as the organization adapts its regional strategy amid mounting financial and structural pressures. The implications for homeland security warrant consideration: Hezbollah’s Latin American networks could exploit cross-border vulnerabilities, manipulate existing trafficking routes into U.S. cities, and potentially leverage criminal networks for intelligence collection or operational support within the United States.\n\nThe October 2023 Hamas attacks on Israeli soil and subsequent escalation have dramatically altered regional dynamics, with recent Israeli strikes eliminating key Hezbollah leadership figures, including Secretary-General Hassan Nasrallah. As the organization faces unprecedented operational constraints in Lebanon, Syria, and elsewhere, its Latin American networks—historically, used predominantly for fundraising—could become increasingly valuable for providing operational redundancy and alternative bases of operation far from its primary theater.\n\nProven Capability, Persistent Intent\n\nHezbollah’s Latin American footprint is neither new nor theoretical. The organization has maintained a presence in the region since the early 1980s, establishing networks that span at least 12 countries from Mexico to Argentina. Their composition—a complex web of direct operatives, ideological supporters, opportunistic criminal partners, and diaspora community members with varying degrees of organizational connection—makes these networks particularly challenging to counter.\n\nThese diffuse networks have demonstrated both fundraising capacity and operational capability, most devastatingly through the 1992 bombing of the Israeli embassy and the 1994 attack on the AMIA Jewish community center in Buenos Aires, which killed 85 people and injured more than 200.\n\nMore recently, in November 2023, Brazilian authorities disrupted a suspected Hezbollah cell planning attacks against Jewish targets—just one month after the Oct. 7, 2023, attack in Israel. In 2024, Argentinian authorities flagged possible Hezbollah activity at a high-volume port in Iquique, Chile, after spotting Assad Ahmad Barakat—one of Hezbollah’s most notorious money launderers. Though we cannot conclusively link the Brazilian plot and Barakat’s presence to changing dynamics in the Middle East, these developments suggest Hezbollah affiliates may be attempting to fill operational and funding gaps after incurring massive losses. Defense strategists should pay careful attention to the continuity of intent and the organization’s proven ability to execute high-casualty operations thousands of miles from Lebanon.\n\nAlthough Hezbollah has historically received at least 70 percent of its funding from Iran, its Western Hemispheric networks provide critical supplementary revenue through sophisticated criminal enterprises. These include drug trafficking, arms smuggling, document fraud, and money laundering operations, often conducted in partnership with local criminal organizations. The Ayman Joumaa network, for instance, laundered hundreds of millions of dollars through cocaine trafficking and used car sales in the U.S. before the Department of Homeland Security’s Customs and Border Protection, Federal Bureau of Investigations, and other U.S. agencies disrupted its operations.\n\nThe terror-crime nexus may represent a strategic evolution rather than mere opportunism. By embedding itself within existing criminal ecosystems, Hezbollah simultaneously achieves multiple objectives: diversifying funding sources beyond Iranian patronage, establishing plausibly deniable operational capabilities, and developing relationships that could be leveraged for logistical support during heightened conflict.\n\nTwo geographical hubs have emerged as critical for Hezbollah’s regional presence: the Tri-Border Area—where Argentina, Brazil, and Paraguay meet—and Venezuela under the Hugo Chávez and Nicolás Maduro regimes. Each offers distinct advantages. The Tri-Border Area provides a semi-lawless environment with limited law enforcement oversight—conditions that Hezbollah operatives exploited when planning and coordinating logistics for the 1994 Buenos Aires bombing. Venezuela, by contrast, offers explicit state support, including political protection, passport provisioning, and transportation networks through state-owned enterprises like CONVIASA airline.\n\nVenezuela’s strategic partnership with Iran, formalized in a 20-year cooperation agreement in 2022, has further strengthened Hezbollah’s position. Maduro explicitly aligned his country with Iran’s “Axis of Resistance,” creating an environment where Hezbollah operatives can move freely, access resources, and potentially develop operational capabilities with limited scrutiny.\n\nThrough a coordinated approach that includes cultural centers, educational scholarships, media operations like HispanTV, and diplomatic infrastructure in Latin America, Iran more broadly cultivates influence that creates an environment potentially sympathetic to Hezbollah. The 2023 Spanish translation and distribution of Supreme Leader Khamenei’s memoir exemplifies Iran’s efforts to build regional, ideological connections—a pattern that mirrors Hezbollah’s historical development in Lebanon.\n\nExtending beyond traditional diplomacy, Iranian embassies have been identified in congressional testimony and regional security analyses as potential hubs for covert activities. Meanwhile, investigations have documented Iranian involvement in illegal gold mining operations in Venezuela’s Orinoco Mining Arc, providing financial resources that could indirectly support Hezbollah’s regional networks.\n\nThe Information Deficit\n\nDespite these concerning patterns, stakeholders rely on outdated public information to understand Hezbollah’s Latin American networks. The most recent unclassified analysis specifically addressing terrorist threats in Latin America, including Hezbollah, was published almost a decade ago. The last focused public congressional hearing on Iran and Hezbollah in the Western Hemisphere occurred even earlier in March 2015.\n\nThis knowledge gap isn’t merely an academic concern—it fundamentally undermines the nation’s operational effectiveness in combating terrorism, particularly at the U.S. southern border. Without a current, shared understanding of how Hezbollah’s networks function, agencies tend to focus on individual criminal cases rather than recognizing and disrupting the broader organizational infrastructure. Diminished public focus has additional consequences: the U.S. Departments of Homeland Security and Justice can struggle to build cases with dated evidence, financial institutions may lack current typologies to detect evolving money laundering schemes, and regional partners may operate with obsolete threat assessments that fail to capture new operational patterns. This fragmented approach allows Hezbollah affiliates to adapt quickly, replacing disrupted cells while maintaining strategic continuity.\n\nAs I detail in “Hezbollah’s Networks in Latin America,” robust unclassified analysis serves several critical functions beyond classified intelligence channels. It enables informed public discourse, supports legal proceedings, facilitates diplomatic engagement with regional partners, and helps counter potential disinformation campaigns. Enhanced public understanding through unclassified assessments can also build support for counterterrorism initiatives and foster international cooperation.\n\nThe volatility of Middle East dynamics, combined with increased U.S. support for Israel, creates conditions where Hezbollah might be more inclined to leverage its global networks more aggressively, including in Central and South America. While the organization may prioritize its immediate sphere of influence, its established Latin American infrastructure provides options for asymmetric responses that minimize direct escalation in the Middle East.\n\nAs policymakers put pen to paper on future security frameworks, understanding Hezbollah’s Latin American operations is a component that must not be overlooked. Moving beyond the historic pattern of exaggerating or dismissing the organization’s capabilities requires a comprehensive, evidence-based approach open to public audiences. Only through such rigorous, open-source analysis can a public understanding of these evolving threats be developed, leaving no significant vulnerabilities unaddressed at a moment when Hezbollah may be increasingly motivated to exploit them.\n\nFrom RealClearWire\n\nViews expressed in this article are opinions of the author and do not necessarily reflect the views of The Epoch Times."
  },
  {
    "title": "Protecting Medicaid Coverage Is Crucial for Fighting Opioid Crisis",
    "url": "https://www.theepochtimes.com/opinion/protecting-medicaid-coverage-is-crucial-for-fighting-opioid-crisis-5836585",
    "text": "Commentary\n\nOne of the most important—and difficult—roles of government is to craft a budget rooted in reality, in which spending is aligned with revenue. When I took office as governor of New Jersey, the state faced an $11 billion deficit on a $29 billion dollar budget. I’ll be the first to admit that the process of closing that enormous gap was slow, grueling work, and it rarely left anyone happy. Even so, it was also an opportunity to embrace new ideas, strengthen existing policies, and eliminate inefficient spending. The end result? A balanced budget that was smaller than the year before.\n\nAs tough as the budget situation was in New Jersey when I took office, our federal budget is in even more desperate need of an overhaul. Considering that the national debt currently stands at a staggering $36.2 trillion—with interest on the debt now exceeding the defense budget—coupled with the recognition that there has been an annual federal deficit for the last quarter century, it should be clear that significant and well thought out program reforms and spending cuts are essential to turn things around. Congress has begun this important work with the budget resolution and will now spend the coming months on budget reconciliation legislation reducing spending to meet real world fiscal targets.\n\nYet even as every program is reviewed and necessary cuts enacted, it is vital that our most important priorities be maintained—one of which is continuing the progress being made combating the opioid epidemic.\n\nThe opioid crisis continues to be a plague on American health, well-being, and prosperity. More than 645,000 lives have been lost, a number made even more painful to bear considering that each of those lives touched countless others among us—family members, friends, and colleagues. States, communities, schools, and families across the country have grappled with the devastating consequences of substance abuse and have called upon our nation’s leaders to lead the charge against this silent killer. Leaders in both parties have answered the call at both the state and federal levels through bipartisan support to raise awareness, improve prevention, and expand access to treatment. One of the most effective ways of providing access to treatment is the Medicaid program, which provides coverage for medication-assisted treatment (MAT) and other forms of care for opioid and substance use disorders (OUDs/SUDs).\n\nNow is not the time to risk progress by unwinding reforms that have been so effective. Now is the time for Congress to safeguard access to OUD/SUD treatment in the budget reconciliation process. OUD/SUD recovery cannot occur without adequate treatment, adequate treatment cannot take place without Medicaid, and Medicaid requires the continued support of the federal government.\n\nViews expressed in this article are opinions of the author and do not necessarily reflect the views of The Epoch Times."
  },
  {
    "title": "Creation of Abundance Is a Corporation’s Purpose",
    "url": "https://www.theepochtimes.com/opinion/creation-of-abundance-is-a-corporations-purpose-5836452",
    "text": "By Terrence Keeley\n\n4/5/2025Updated: 4/5/2025\n\nCommentary\n\nDoes capitalism need to be fixed? Is it no longer fit for purpose in this modern era, given our environmental ecosystems are under self-evident strain and income gaps are widening to levels not seen since the “robber baron” era?\n\nThis was the question I was called to answer at David and Philippa Stroud’s inspiring and expanding Forum last weekend. I rephrased the question slightly: Can capitalism promote the common good? Joining me in the discussion were Rand Stagen, Doug Rauch, and Steve Hall—successful entrepreneurs who have coached CEOs to greatness, led iconic Trader Joe’s from near irrelevance to triumph and lifted a marginal automotive company to multi-billion dollar heights. All three of these remarkable entrepreneurs have since graduated to running Conscious Capitalism, an advocacy group that believes business can benefit everyone, most especially when purpose meets profit.\n\nOver Q&A, the discussion turned as it inevitably does to Milton Friedman’s 1970 article “The Social Responsibility of Business Is to Increase Its Profits.” Friedman’s New York Times classic has been credited with spawning Gordon Gekko’s ignominious claim that “Greed is good,” as well as oligarchic tyranny theories which Bernie Sanders effectively promotes and derides. Capitalism’s undeniable negative externalities are why a majority of millennials and Gen-Zers today have concluded socialism would be a superior socio-economic framework.\n\nAnd that’s when controversy ensued. Nobel Laureate Friedman never said businesses should promote profits without guardrails. What he actually wrote is that it is the responsibility of business “to make as much money as possible while conforming to the basic rules of society, both those embodied in law and those embodied in ethical custom.” These two addendums about rules and customs are crucial. And they allowed me to highlight something Adidas has recently done that millennials, Gen-Zers, and Gordon Gekko alike can all rightly applaud.\n\nWorking with Parley Ocean Plastic, Adidas has committed to replacing all the virgin polyester in their products with recycled polyester derived from oceanic plastic waste. This program has been remarkably successful, and it is not all Adidas is doing to rejuvenate the planet. Through their “Made to Be Remade” program, once you’ve had your full run with their shoes and apparel, instead of tossing them in the trash you can send them back to Adidas to be recycled, meaning much less garbage ends up in landfills. Proof of the success of this environmentally mindful strategy comes from the market, however. Since embarking upon their ambitious recycling journey in 2015, Adidas’ stock has risen nearly 400 percent—meaning they have tapped into new consumer demands, opened new markets, and dramatically benefitted their bottom line. Planet protections have handsomely fattened Adidas shareholders’ wallets.\n\nSo, is this an example of stakeholder capitalism—or merely capitalism as Milton Friedman defined it? I would argue it is the latter, perhaps inspired by the former. Like Milton Friedman, I would further argue it is the type of capitalism all public companies should strive for.\n\nConsumer attitudes evolve. Farsighted companies like Adidas find ways to change with them. Adidas’ consumer strategy was met with commercial success. This means it can be sustained. Other nobly-minded public corporate officials evolved faster than consumers did—like Emmanuel Faber at Danone or Bud Light’s marketing team. They misunderstood the market and ultimately saw their sales and profits plummet. They are no longer making corporate decisions. Too many stakeholder capitalist instincts are like these: well-intended but unsustainable. If enduring impact is a public company’s goal, its bottom line must remain black. If growing impact is part of a public company’s calling, growing profits and rising stock prices are essential.\n\nSo what should we conclude about the future of capitalism and its role in promoting the common good? For stakeholder capitalism to succeed, it must remain capitalistic—and for a society to succeed, ubiquitous public virtue is needed. Business’s potential role in propagating such virtues is circumscribed. Greater public mindfulness spawned by the universal principles of human dignity, subsidiarity, and solidarity would undoubtedly promote broader social inclusivity and lasting environmental sustainability, aspirations largely enunciated by the United Nation’s Sustainable Development Goals. Great companies may well find ways to reinforce these virtues and benefit from their broader acceptance—but they must also find ways to persevere when we humans fail to be all we can and should be, something we invariably seem to do.\n\nThe ultimate purpose of a corporation is to mindfully generate the material abundance society needs to make our way, as John 12:35-36 and Isaiah 42:16 suggest, through the darkness to the light. If business can further amplify light along the way, all the better. We humans will likely to get the future we work towards. My hope is that greater mindfulness will lead to greater inclusivity, sustainability, and economic growth. Within profit’s constraints, business can and should make all three of these goals more attainable—and within prevailing rules and social customs, should not actively thwart them.\n\nFrom RealClearWire\n\nViews expressed in this article are opinions of the author and do not necessarily reflect the views of The Epoch Times."
  },
  {
    "title": "Diabetes Medications Linked to Increased Risk of Thyroid Cancer",
    "url": "https://www.theepochtimes.com/health/diabetes-medications-linked-to-increased-risk-of-thyroid-cancer-5797157",
    "text": "A recent study suggests a possible link between thyroid cancer and diabetes drugs like Ozempic and Rybelsus, especially in the first year of use.\n\nPeople within the first year of GLP-1RA treatment had a 1.85 times higher chance of being diagnosed with thyroid cancer. In subsequent years, the risk decreased to 1.27 times higher for people who had been taking GLP-1RA medications for two or more years.\n\nHowever, overall, in absolute numbers, 69, or 0.17 percent of the participants developed thyroid cancer.\n\nThe researchers suggested that enhanced medical monitoring may explain the uptick in diagnoses rather than indicating that GLP-1RAs themselves cause thyroid cancer.\n\n“This finding may have been due to enhanced early detection; therefore, further research is necessary to understand the underlying causes of this association,” they pointed out.\n\nAdditionally, the study focused on patients using GLP-1RAs for the treatment of diabetes rather than for obesity management or the reduction of cardiovascular disease risk.\n\n“The metabolic advantages of GLP-1RA likely outweigh the possible risk of thyroid cancer,” the researchers wrote."
  },
  {
    "title": "How to Heal Your Gut to Fight Common Fungus Overgrowth",
    "url": "https://www.theepochtimes.com/health/how-to-heal-your-gut-to-fight-common-fungus-overgrowth-5831023",
    "text": "Modern lifestyles—packed with processed foods, chronic stress, and restless nights—create the perfect environment for Candida, an opportunistic fungus, to thrive. At the heart of the issue lies a disrupted gut microbiome, where the balance between microorganisms has been tipped in favor of overgrowth.\n\nBy identifying the factors that fuel microbiome disruption and implementing strategies to restore balance, you can reduce the fungal load and experience much-needed relief.\n\nA Western diet that is low in fiber and high in processed fats and added sugar is a major factor, as it causes inflammation over time and reduces healthy gut bacteria, making it easier for Candida to grow, she said.\n\nThe processing of Western foods often involves adding preservatives, heating, and hulling—the removal of the outer coat of grains or seeds—all of which affect the microbes in the food. While these processes help reduce spoilage and harmful bacteria, they also strip away beneficial bacteria essential for controlling Candida levels.\n\n“Balance is the key to a healthy microbiome, which is crucial for controlling overgrowths like Candida,” said Bragagnini.\n\nThe anti-Candida diet limits carbohydrate and added sugar intake, as sugar fuels the growth of Candida. It also involves avoiding yeast-containing foods, such as baked goods, yeast-leavened breads, alcohol, and vinegar—except for raw apple cider vinegar. Other foods to avoid include soy sauce, tempeh, miso, malt, nutritional yeast, and those with high mold contamination potential, like peanuts, cashews, and aged or moldy cheeses, Tshukudu advised.\n\nIt’s also important to stay hydrated and include cruciferous vegetables—like kale, cabbage, and cauliflower—and black and blue foods, including berries and eggplant, which can help support the body in detoxing, Tshukudu added.\n\nStart your day with herbal tea or water. Good options include mint, ginger, cinnamon, or clove tea.\n\nEat 2 to 3 scrambled or poached eggs alongside 1 cup of sautéed spinach cooked with garlic in 1 teaspoon of coconut oil or extra-virgin olive oil. Add 1 slice of seed crackers or seed bread. Enjoy a cup of herbal tea, such as ginger and turmeric or mint.\n\nHave a small serving of seed granola with 1/2 cup of plain yogurt. Sip an herbal tea such as rooibos flavored with cinnamon."
  },
  {
    "title": "Childhood Cancer Survivors Face Accelerated Aging, Health Problems Decades Earlier Than Most",
    "url": "https://www.theepochtimes.com/health/childhood-cancer-survivors-face-accelerated-aging-health-problems-decades-earlier-than-most-5829414",
    "text": "Childhood cancer survivors are winning their battle against the disease, but many are facing a new challenge: a fight against accelerated aging that comes with their life-saving treatments.\n\nAccording to recent research, this accelerated aging can lead to health problems typically seen in older adults, not just the feeling of getting older.\n\n“We found that all childhood cancer survivors, regardless of their diagnosis or radiation exposure, experience accelerated aging and are projected to develop age-related conditions much earlier than the general population,” Jennifer Yeh, professor of pediatrics at Harvard Medical School, told The Epoch Times.\n\nWhile people over 60 are used to managing a range of health issues like heart disease, stroke, or age-related muscle loss, those in their 20s to 40s typically don’t face these concerns. However, this creates a problem, says Dr. Lisa Diller, an oncologist and study lead, who is a physician at Dana-Farber Cancer Institute and Boston Children’s Hospital.\n\nResearchers say that their study may help childhood cancer survivors make more informed health decisions, as their aging process differs from that of most people.\n\n“Our ability to measure more than one outcome, and to predict what will happen in mid- and late adulthood, is limited,” said Diller.\n\n“This study gives a more comprehensive picture of survivor health over a lifetime,” said Yeh, who developed the simulation model and is a researcher at Boston Children’s Hospital. It also provides a more realistic view than previous studies that focused on short-term risks or a single condition, she noted.\n\nHistorically, all children with leukemia received cranial radiation to prevent cancer recurrence in the brain, Diller said. However, over time, doctors realized that this treatment caused significant long-term cognitive issues and executive function problems. As a result, the use of radiation has dramatically decreased in recent years.\n\nNevertheless, children treated for leukemia without radiation still experience accelerated aging, with health issues appearing about 10 years earlier than expected. According to the researchers, this suggests that the treatments themselves—whether chemotherapy or the experience of cancer—contribute to long-term health risks, not just radiation.\n\nThe Harvard findings support a shift in health policy: childhood cancer survivors need tailored health care as adults and early interventions to manage health risks that appear earlier than expected. This approach would focus on preventing, managing, and monitoring chronic conditions that emerge prematurely as a result of cancer treatments.\n\nYeh stated that their findings suggest that survivors should begin early screenings for conditions like breast cancer, colon cancer, and heart disease, and to consider preventive treatments such as tamoxifen, used to reduce the risk of breast cancer, or beta blockers to protect the heart.\n\nExperts also recommend lifestyle changes in managing these risks, including regular exercise, a healthy diet, and limiting alcohol consumption.\n\nDiller noted the importance of health systems integrating long-term survivorship care into routine healthcare. As she explains, these survivors need ongoing support to address both the immediate and long-term effects of their cancer treatment.\n\n“You might interpret their real age to be more like in their 50s or 60s, depending on which late effects you’re looking at,” Diller said. “Everything’s advanced by 10 or 15 or 20 years.”"
  },
  {
    "title": "Andrew Marvell’s ‘The Garden’ and the Restorative Power of Nature",
    "url": "https://www.theepochtimes.com/bright/andrew-marvells-the-garden-and-the-restorative-power-of-nature-5836418",
    "text": "In the poem, Marvell (1621–1678) compares ambition and achievement with the verdant beauty and gentle peace of nature, suggesting that true contentment is found in the latter, and not the former. Marvell celebrates contemplative solitude, the appreciation of nature, and spiritual values, while criticizing the values that society so often promotes, including ambition, success, and sensual passion.\n\nThis is an interesting critique of society from a man who was best known during his lifetime for his political activity and authorship of erotic poems such as “To His Coy Mistress.” Yet Marvell’s shift of perspective makes some sense if he wrote this work in retirement, around 1650, as most critics believe. If that’s the case, then these sentiments are the sentiments of a man of political note reflecting back on his life and career.\n\nThe aging poet concludes that much of it lacked meaning, insofar as he busied himself trying to win the acclaim of others, the frantic pursuit of a gleaming glory that fades almost as soon as it is won. The poem expresses, perhaps, a lesson that Marvell learned the hard way: Passion is fleeting, praise is transient, and all the money in the world is nothing compared to the wealth of beauty found in common things like plants.\n\nMarvell knew something of worldly achievements. Better known as a politician than a poet until relatively recently, Marvell was educated at Cambridge, served in the House of Commons, tutored members of the nobility (including a ward of Cromwell), and worked as an assistant to the literary and political titan John Milton.\n\nThe decision to symbolize these achievements using plants was a brilliant move because it allowed Marvell to show how paltry a single palm, oak, or bay leaf looks when compared to the abundance of an entire garden of plants, flowers, and trees—which he is about to describe. Through the deft use of imagery, Marvell emphasizes the smallness of these human endeavors when compared with both the rich natural world and the expansive spiritual realm. He also compares it with the spiritual world, which he describes using images from nature, such as the ocean.\n\nIn this contrast between the commotion of society and the tranquility of nature, Marvell anticipates the English Romantic poets, who heavily emphasized the need to escape the corruption of human society and the triviality of political bickering by entering into nature. The idea that society is “rude” (meaning “insensitive”) to the beauties of solitude in nature were taken up by William Wordsworth in “The World is Too Much With Us” or, later still, the verses of Gerard Manley Hopkins in “God’s Grandeur.”\n\nThe next few stanzas develop this comparison. “No white nor red was ever seen/ So am’rous as this lovely green.” White and red were considered symbolic of romantic passion in the 17th century, but Marvell argues the green of the garden is a better color. He then argues that the tree in which a man cut his lover’s name is actually more beautiful than the woman in question. Next, he notes that “When we have run our passion’s heat/ Love hither makes his best retreat.” In this pair of lines, Marvell contrasts the transience of passion with the stable tranquility of the garden, which waits, ever-new, for the lover to make his or her “retreat.”\n\nThe following stanza, stanza 5, indulges in lush detail, steeped in sensory language to accentuate the garden’s appeal. “Ripe apples drop about my head; / The luscious clusters of the vine / Upon my mouth do crush their wine.” Sibilant sounds throughout these lines reflect and mimic the sound of slurping down rich juices, fruits, and wines. It’s enough to make your mouth water. After eating the fresh fruit, the poet can collapse on a bed of turf: “Stumbling on melons as I pass/ Ensnar’d with flow’rs, I fall on grass.”\n\nThe following stanza makes this turn even more explicit as the poet casts aside ‘the body’s vest” while the soul rises freely to the treetops. “There like a bird it sits and sings.” The speaker discovers ever-greater freedom through spiritual contentment.\n\nThe “skillful gard’ner” is, of course, God, who composed all beautiful things in both the natural and spiritual realms. In the final stanza, the speaker himself vanishes, dissolving into a perfect union with the natural environment and, perhaps, its Creator. Dominant images are sunlight, the gentle passage of time, and the mesmerizing humming of a bee.\n\nAs Baibhav put it, “The only industry in this garden of meditation and reflection ... is that of the bee, which, unlike the busy humans of the opening sections, moves with the rhythms of nature.”\n\nThose rhythms, as expressed by the turning of heavenly bodies and the recurring seasonal activity of the bee, have something eternal to them. And so the poem—like the poet—comes to a place of enduring rest and stability in its conclusion."
  },
  {
    "title": "Antonello da Messina’s Blue Madonna",
    "url": "https://www.theepochtimes.com/bright/antonello-da-messinas-blue-madonna-5830647",
    "text": "Amidst a long lineage of blue Madonnas, “Virgin Annunciate” has a magnetism that compels contemplation.\n\nBy Michelle Plastrik\n\n4/5/2025Updated: 4/7/2025\n\nMadonnas dressed in blue have been a foundational feature in Western art since the early 5th century. Historically, the finest blue pigment was exorbitantly expensive, more costly than gold, and its use for Mary the Mother of God was a means of honoring her. Perhaps the greatest painting of Mary that illuminates her connection with this color is the Italian Renaissance artist Antonello da Messina’s “Virgin Annunciate.”\n\nMagnificently painted in oil on wood around 1475 to 1476, the small devotional picture has been compared to the “Mona Lisa” due to its embodiment of magnetic, mysterious, and serene beauty.\n\nThe Innovative Sicilian\n\nAntonello da Messina (circa 1430–1479) was a major Quattrocento artist (Italian Renaissance of the 1400s) and the greatest painter of his era to come from Sicily, Italy. Born Antonello di Giovanni d’Antonio in the small city of Messina, he has long been cited scholastically as the importer of the technique of oil painting to Italy. While this is now known to be an untrue assertion, Antonello was technically brilliant—nearly peerless—in the medium. Especially in realistic portraits, he used oil to depict minute details and subtle color. He brought his subjects to life: Sitters appear as if they are partaking in an unspoken dialogue conveyed by their facial expressions.\n\nThe artist’s “Portrait of a Man” at London’s National Gallery is considered a prime example of his lifelike painting. Antonello’s ability to display psychological aspects that offer glimpses of an interior life was innovative in European painting.\n\nAntonello’s artworks reflect cosmopolitan exposure, which was surprising given that his hometown was viewed as a peripheral to Europe. His influences ranged from fellow Italians to Netherlandish artists—oil paint pioneers—along with French, Spanish, and Provençal painters. Antonello spent most of his life in Messina, although there are confirmed visits to Naples and Venice.\n\nIt was during his time in Naples, where he may have trained artistically, that scholars believe he was exposed to works by the likes of Jan van Eyck and Rogier van der Weyden. The question of whether he did, in fact, journey to the Netherlands or other countries continues to intrigue art historians, given his glorious distillation of foreign artistic advancements.\n\nOne of his most prized paintings is “Saint Jerome in His Study,” remarkable for its harmonious exploration of space and light. Amusingly, a century after it was made, a Venetian art connoisseur declared it must be the work of a Netherlandish artist like van Eyck, dismissing the possibility that it could be from the hand of an Italian.\n\nIn addition to portraits, Antonello was a great painter of religious scenes and landscapes. A highpoint of Antonello’s career was a 1475 to 1476 sojourn in Venice, to which he may have made additional trips. During this specific trip, he received a commission for the “San Cassiano Altarpiece.” Only the altarpiece’s central fragment of a Virgin and Child surrounded by saints survives at Vienna’s Kunsthistorisches Museum. In its original state, it was, along with other works by Antonello, of great inspiration to Venetian artists such as Giovanni Bellini.\n\n“Virgin Annunciate” dates either to his Venetian period or just after his return to Messina. The work is housed in the Galleria Regionale della Sicilia, which is in Palermo’s Palazzo Abatellis. This painting has been subject to misattributions—thought at one point to be by Albrecht Dürer as well as confused with a minor copy in Venice’s Gallerie dell’Accademia. Now regarded as a masterpiece by Antonello, it is considered one of the finest panel paintings of the Early Italian Renaissance.\n\nLuxury and Labors of Lapis Lazuli\n\nBlue pigment has been revered for millennia. It is difficult to find and extract from natural sources, so it became a luxury commodity with connotations of wealth, royalty, and divinity. Ultramarine is a “true blue” pigment derived from the metamorphic rock lapis lazuli. Famous historic deposits are in Afghanistan. Highly labor-intensive to extract the blue from the stone and prepare as a pigment, the resulting substance traveled throughout Asia via the Silk Road.\n\nByzantine artists were the first to clothe Mary in a blue mantle, though the cheaper pigment from the mineral azurite was used for these icons. Over time, blue took on symbolic meanings of purity, humility, and holiness.\n\nStatic medieval icons of the Madonna in blue with the Christ Child evolved in the Renaissance to paintings featuring narrative scenes of her life. A breathtaking Mary in blue that predates Antonello’s version is in van Eyck’s “The Annunciation.” In addition, polychrome sculptures from the period show the Virgin in blue.\n\n‘Virgin Annunciate’\n\nAntonello’s poignant Virgin is draped in a warmly saturated, voluminous blue fabric. She is a young teenager, perhaps 13 or 14, but poised beyond her years. The Madonna sits in front of a dark and isolated background that communicates a sense of sacredness. The artist’s construction of the composition renders her both realistic and enigmatic. She seems tangible: Her expertly foreshortened hand extends over the open prayer book to the viewer in blessing, but her modest pose and lowered eyes convey a reserve.\n\nThis version of the Annunciation, which was a popular theme in Renaissance painting, is unusual in that the archangel Gabriel is not pictured. Instead, the artist has positioned the viewer in his place, deepening the emotional connection between the figures within and outside the picture plane. Amid a long lineage of blue Madonnas, “Virgin Annunciate” maintains a magnetism that compels contemplation.\n\nWhat arts and culture topics would you like us to cover? Please email ideas or feedback to [email protected]"
  },
  {
    "title": "8 Simple, Science-Backed Habits to Build a Stronger Brain and Fight Cognitive Decline",
    "url": "https://www.theepochtimes.com/article/8-simple-science-backed-habits-to-build-a-stronger-brain-and-fight-cognitive-decline-5812498",
    "text": "Experts share eight proven ways to hone a sharper, stronger, more resilient brain.\n\nBy Amy Denney\n\n|\n\nApril 05, 2025Updated:April 05, 2025\n\nForget what you’ve heard about the inevitability of cognitive decline. Your brain can thrive at every age, and it’s never too late to hone your mind.\n\nScience reveals that we can actively sharpen mental focus, protect against memory loss, and improve mood, attention, and problem solving. Surprisingly, it’s not complicated. Basic self-care strategies adopted as lifestyle habits go a long way to keeping your brain in tip-top shape.\n\nNeurologist Dr. David Perlmutter and psychiatrist Dr. Drew Ramsey, authors of best-selling books on the brain, are both on a mission to help people approach brain health similarly to physical exercise. In the same way that we train our bodies for strength and endurance, anyone can train a more resilient brain. Here’s how.\n\n1. Eat Whole Foods\n\nDiet is the most vital piece of the puzzle, according to Dr. Perlmutter. The brain uses 25 percent of the body’s energy, even though it makes up about 5 percent of body weight.\n\nDr. Ramsey, a pioneer in nutritional psychiatry, added that science is connecting the dots between what we put on our fork and how we feel. Eating more whole foods such as seafood, greens, nuts, and beans promotes mental resilience, while sugary foods such as energy drinks and baked goods interfere with mood and focus and contribute to anxiety.\n\nAvoid Processed Foods\n\nThe role of food in brain health is perhaps most apparent in Alzheimer’s disease, which has been called Type 3 diabetes because its features overlap with both Type 1 and Type 2 diabetes. Alzheimer’s can be caused by brain insulin resistance, which happens when we expose our bodies to too much blood sugar and our cells can no longer absorb glucose—our main brain fuel source—from the blood.\n\n“That means avoiding ultra-processed foods, highly processed grains, anything that will dramatically and suddenly raise blood sugar,” Dr. Perlmutter said. “That is a clear and present danger to the brain.”\n\nUltra-processed foods are industrially manufactured with artificial ingredients. They include sugary cereals, chips and other packaged snacks, soft drinks, frozen meals, candy, commercial baked goods, and fast food. Highly processed grains are often stripped of fiber, vitamins, and minerals, and include breads with refined flour, instant oatmeal, flour tortillas, rice cakes, and many types of pasta.\n\nWearing a continuous glucose monitor can help identify other foods that cause spikes in blood sugar.\n\nChoose the Right Fats\n\nDr. Perlmutter advises feeding the brain instead with a “longer-burn type of fuel,” such as healthy fats. Fat-free eating isn’t ideal, because the brain is 70 percent fat—“It doesn’t get fat out of thin air,” he said.\n\nBut the type of fat matters. Wild-caught fatty fish and fish oil are high in essential omega-3 fatty acids, such as docosahexaenoic acid (DHA) and eicosapentaenoic acid (EPA), which Dr. Perlmutter says are structurally important for the brain. These include salmon, anchovies, sardines, and mackerel. Avoid refined seed and vegetable oils, such as corn oil, soybean oil, and canola oil, which have been highly processed to increase their shelf life and are higher in pro-inflammatory components.\n\nEat a Rainbow of Fruits and Vegetables\n\n“If you look at your plate and you don’t have three natural colors on your plate, go back to the kitchen. Find another color,” Dr. Ramsey said. “If food is medicine, this is a way of diversifying your medicine cabinet.”\n\nBrightly colored fruits and vegetables are rich in polyphenols, which enhance the function of the bacteria that live in our gut. A colorful diet is associated with a more diverse microbiome, which has been linked to better cognitive health and lower risk of diseases like dementia and Parkinson’s.\n\nFruits and vegetables are also rich in fiber. Our gut bacteria need it to make short-chain fatty acids that help reduce inflammation in the body, make B vitamins, and create neurotransmitters, Dr. Perlmutter said. Aim for about 60 grams of fiber daily—three times the amount a typical American eats.\n\n2. Move Your Body\n\nMake it your goal to exercise at least 2 1/2 hours every week. Don’t obsess over when you work out, Dr. Perlmutter said—newer research shows it’s just as effective whether it’s done all on the weekend or spread out over the week.\n\nExercise lowers your insulin sensitivity. It also helps the body make a compound vital for learning and memory called brain-derived neurotrophic factor, which Dr. Perlmutter says is “like Miracle-Gro for the brain.” When we increase its production, “we can actually turn on the process of growing new brain cells and forming new connections between brain cells,” he said. “The best way to do that is to exercise.”\n\nHis personal prescription is daily stretching, balance exercises, 30 minutes on the elliptical machine, and weight lifting. He also plays pickleball every other day.\n\nRamsey recommends combining exercise with other habits that are beneficial to brain health, like being outdoors or in community. Not only does it offer a double brain bonus, but it also makes it easier to automate new habits.\n\n3. Prioritize Quality Sleep\n\nGetting good quality, restorative sleep is crucial to brain health. The brain is active at night, conducting functions related to learning, memory, and toxin removal. The problem is that most people underestimate the importance of sleep, as well as how well they’re actually sleeping.\n\nBoth Dr. Perlmutter and Dr. Ramsey recommend using a sleep-tracking wearable, such as an Oura ring, which collects around-the-clock data on whether you’re sleeping an optimal four to six sleep cycles per night. Different types of sleep in each cycle play different roles in brain health.\n\nWhether or not you use a tracking device, he listed some basic sleep-inhibiting factors to avoid:\n\nExercising too close to bedtime.\n\nEating two to three hours before sleeping.\n\nToo much light in the bedroom.\n\nToo warm of a sleeping environment.\n\nNoise or sleeping with a restless partner.\n\nDr. Ramsey, who has struggled with insomnia, said that using a sauna several nights a week has helped his sleep. He also bought room darkening curtains after his Oura ring alerted him to disrupted sleep, which made him reevaluate his bedroom and notice that a neighbor’s new light was spilling onto his pillow.\n\nLight is an important cue for setting our circadian rhythm, our internal clock that governs our sleep-wake cycle. The best way to reset it, Dr. Ramsey said, is to go outside to view light in the morning and dim inside lights in the evening.\n\n4. Challenge Your Curiosity\n\nDo something that requires significant cognitive engagement for several hours each day. Dr. Perlmutter is 70 but actively blogs, hosts a podcast, and is always working on a book.\n\n“For me, it’s extremely invigorating,” he said. “Once I finish the work, it still reverberates in my mind for the rest of the day. I keep thinking about things that are increasing my curiosity. I’m grateful I found an area I’m so intrigued by.”\n\nNeglecting curiosity is associated with depression. Dr. Ramsey added that journaling or being part of group therapy can help foster healthy curiosity.\n\n5. Make Music\n\nPlaying, singing, or simply listening to music has profound effects on the brain beyond mood. Just listening to music can improve sleep, memory, and mental alertness, while lowering blood pressure, pain, and anxiety.\n\nDr. Perlmutter plays guitar for at least 30 minutes a day. Lately, he’s challenging himself to learn music written in the 1970s.\n\n“When you can play a song written and performed by someone like Joni Mitchell that comes to life from your own instrument and your voice, it really touches a special place in your soul,” he said.\n\n6. Think Good Thoughts\n\nFeed your brain good thinking. Thoughts influence brain structure, function, and chemistry, mostly through a mechanism called neuroplasticity, which strengthens or weakens neural pathways by repeated patterns of thinking.\n\nPositive thinking releases neurotransmitters called dopamine and serotonin that improve mood and promote the growth of neurons. Dr. Perlmutter said optimism is also linked to lower stress, as well as improved resilience against an aging brain. That means intentionally positive thoughts can improve your memory, ability to solve problems, and emotional resilience.\n\nOn the other hand, chronic stress or negative thoughts release cortisol, which can shrink the hippocampus, a part of the brain important for memory and learning. It also over-activates the amygdala, which can reinforce fear and anxiety. The result is an increased risk of mood disorders and cognitive decline.\n\n7. Build Community\n\nTap into the power of community and connection, which benefits mood and also helps hold us accountable to goals. “Human beings have always had a set of stressors that make mental health tough, but there are some new challenges in town: screens, toxins, new social structures, and a lot of factors that promote disconnection,” Dr. Ramsey said. He says to take building new connections as a personal responsibility.\n\nFor him, prioritizing his family and self-care are of utmost importance, though it’s easy to be distracted and get off track. He makes that goal concrete by recording how often his family eats meals together.\n\nDr. Ramsey connects his patients’ interests to a community. For instance, he might assign someone who likes rock climbing to join a rock climbing gym. There, they can build relationships with people who have common interests and will help facilitate their goals.\n\n8. Commit to Self-Improvement\n\nAll of these tips hinge on the desire to change. Better brain health involves ongoing personal accountability. Start by taking an inventory of your life and commit to being self-aware, Dr. Ramsey advised. He keeps a journal to determine where his life isn’t matching his goals.\n\n“Self-awareness is such a powerful tenet of mental fitness,” he said. “It’s really how we enact change in our lives, how we recognize problems, how we take control and shift from an externalizing stance and take responsibility for our life. I think about it as the first step to healing.”\n\nThis article was originally published in American Essence magazine."
  },
  {
    "title": "Senate Passes Trump’s Agenda Budget Blueprint After Late-Night Voting Session",
    "url": "https://www.theepochtimes.com/us/senate-passes-trumps-agenda-budget-blueprint-after-late-night-voting-session-5837112",
    "text": "WASHINGTON—The U.S. Senate in the early morning hours of April 5 approved a budget blueprint to advance President Donald Trump’s agenda after a marathon voting session.\n\nUnder the rules of the reconciliation process, which is being used to pass the sweeping package, all amendments must be considered—leading to voting sessions that last well into the night, known as a “vote-a-rama.”\n\nThis time was no different, as the long vote series began in the evening on April 4 and continued into the early hours of April 5. Lawmakers finally advanced the resolution in a 51–48 vote, which fell mostly along party lines, with Republican Sens. Susan Collins of Maine and Rand Paul of Kentucky both voting against.\n\nThe all-night session included votes on Democratic amendments that targeted Trump’s tariffs, the potential effects of the budget bill on the federal deficit, and that sought to limit tax cuts for the wealthy. They all failed.\n\nWith its passage by the Senate, the budget resolution—which resulted from weeks of bicameral negotiations—heads to the House.\n\nBoth chambers will need to pass the measure to move on to the next stage of the reconciliation process.\n\nMost of its provisions aligned with what was expected from the package, including tax policy, federal funding for energy, defense, and the border, and spending cuts.\n\nIts centerpiece is making permanent the income tax cuts included in the Tax Cuts and Jobs Act of 2017, which are currently set to expire this year.\n\nUnder the Byrd Rule, nothing in a reconciliation bill can be made permanent if it would cost the government money after a decade.\n\nTo align with this rule, Graham declared his authority to use “current policy” as the baseline to calculate the bill’s long-term effects.\n\nAside from that, the package includes instructions for how much funding each chamber should provide for various purposes. At this stage in the process, those numbers are still allowed to differ in order to provide each chamber flexibility in drafting the legislation.\n\nThe bill orders the Senate to put up $150 billion for defense, while the House is ordered to provide $100 billion.\n\nIt also calls on the House and Senate to allocate $90 billion and $175 billion, respectively, for homeland security. Speaking in support of the bill on the floor, Graham said this funding would be used to reduce the influx of fentanyl, finish the border wall, and provide more detention bed space for deportees.\n\nThe Senate is ordered to find $4 trillion in spending cuts, while that figure is $1.5 trillion for the House. However, it’s likely that the House version will ultimately include steeper cuts of at least $2 trillion.\n\nThat issue has already been the rallying point of Democrats’ opposition to the package.\n\nIn a floor speech against the resolution, Senate Minority Leader Chuck Schumer (D-N.Y.) said it would “eviscerate Medicaid.”\n\nConcerns about the budget’s effect on Medicaid have also circulated among moderate Republicans.\n\nFor some purple district Republicans—particularly those in states such as New York and California—any cuts to the entitlement could be political suicide.\n\nThe debt ceiling describes the top amount of debt the federal government can take on. For many Republicans with a focus on the national debt, measures that raise this limit are inherently unpopular.\n\nThe Senate resolution instructs the House to raise the amount by $4 trillion, and permits a rise of up to $5 trillion in the Senate version.\n\nIn the Senate, this was less of an issue, being a dealbreaker only for Paul. However, in the House, the $5 trillion top line could pose greater challenges.\n\nTo unlock the process, both chambers of Congress must pass an identical blueprint. The Senate resolution, which now goes to the House for consideration, resulted from weeks of negotiations between the two chambers.\n\nWith 220 seats to the Democrats’ 213, House Republicans can spare just three defections and still pass the budget—a tall order for a package that could alienate both moderate Republicans and conservatives for different reasons.\n\nShould the blueprint pass the House, work will be sent to committees to draft the legislation.\n\nThe final package that is passed by both chambers must be identical to make it to Trump’s desk."
  },
  {
    "title": "Senate Passes Trump’s Agenda Budget Blueprint After Late-Night Voting Session",
    "url": "https://www.theepochtimes.com/us/senate-passes-trumps-agenda-budget-blueprint-after-late-night-voting-session-5837112?cmt=1",
    "text": "WASHINGTON—The U.S. Senate in the early morning hours of April 5 approved a budget blueprint to advance President Donald Trump’s agenda after a marathon voting session.\n\nUnder the rules of the reconciliation process, which is being used to pass the sweeping package, all amendments must be considered—leading to voting sessions that last well into the night, known as a “vote-a-rama.”\n\nThis time was no different, as the long vote series began in the evening on April 4 and continued into the early hours of April 5. Lawmakers finally advanced the resolution in a 51–48 vote, which fell mostly along party lines, with Republican Sens. Susan Collins of Maine and Rand Paul of Kentucky both voting against.\n\nThe all-night session included votes on Democratic amendments that targeted Trump’s tariffs, the potential effects of the budget bill on the federal deficit, and that sought to limit tax cuts for the wealthy. They all failed.\n\nWith its passage by the Senate, the budget resolution—which resulted from weeks of bicameral negotiations—heads to the House.\n\nBoth chambers will need to pass the measure to move on to the next stage of the reconciliation process.\n\nMost of its provisions aligned with what was expected from the package, including tax policy, federal funding for energy, defense, and the border, and spending cuts.\n\nIts centerpiece is making permanent the income tax cuts included in the Tax Cuts and Jobs Act of 2017, which are currently set to expire this year.\n\nUnder the Byrd Rule, nothing in a reconciliation bill can be made permanent if it would cost the government money after a decade.\n\nTo align with this rule, Graham declared his authority to use “current policy” as the baseline to calculate the bill’s long-term effects.\n\nAside from that, the package includes instructions for how much funding each chamber should provide for various purposes. At this stage in the process, those numbers are still allowed to differ in order to provide each chamber flexibility in drafting the legislation.\n\nThe bill orders the Senate to put up $150 billion for defense, while the House is ordered to provide $100 billion.\n\nIt also calls on the House and Senate to allocate $90 billion and $175 billion, respectively, for homeland security. Speaking in support of the bill on the floor, Graham said this funding would be used to reduce the influx of fentanyl, finish the border wall, and provide more detention bed space for deportees.\n\nThe Senate is ordered to find $4 trillion in spending cuts, while that figure is $1.5 trillion for the House. However, it’s likely that the House version will ultimately include steeper cuts of at least $2 trillion.\n\nThat issue has already been the rallying point of Democrats’ opposition to the package.\n\nIn a floor speech against the resolution, Senate Minority Leader Chuck Schumer (D-N.Y.) said it would “eviscerate Medicaid.”\n\nConcerns about the budget’s effect on Medicaid have also circulated among moderate Republicans.\n\nFor some purple district Republicans—particularly those in states such as New York and California—any cuts to the entitlement could be political suicide.\n\nThe debt ceiling describes the top amount of debt the federal government can take on. For many Republicans with a focus on the national debt, measures that raise this limit are inherently unpopular.\n\nThe Senate resolution instructs the House to raise the amount by $4 trillion, and permits a rise of up to $5 trillion in the Senate version.\n\nIn the Senate, this was less of an issue, being a dealbreaker only for Paul. However, in the House, the $5 trillion top line could pose greater challenges.\n\nTo unlock the process, both chambers of Congress must pass an identical blueprint. The Senate resolution, which now goes to the House for consideration, resulted from weeks of negotiations between the two chambers.\n\nWith 220 seats to the Democrats’ 213, House Republicans can spare just three defections and still pass the budget—a tall order for a package that could alienate both moderate Republicans and conservatives for different reasons.\n\nShould the blueprint pass the House, work will be sent to committees to draft the legislation.\n\nThe final package that is passed by both chambers must be identical to make it to Trump’s desk."
  },
  {
    "title": "White House Official Says More Than 50 Countries Reached Out for Tariff Talks",
    "url": "https://www.theepochtimes.com/us/white-house-official-says-more-than-50-countries-reached-out-about-tariffs-5837640",
    "text": "A top White House economic adviser said on April 6 that more than 50 countries have contacted the Trump administration to initiate negotiations over a broad swath of tariffs that were announced in the first week of April on nearly every nation in the world.\n\n“They’re doing that because they understand that they bear a lot of the tariff,” he told the outlet.\n\nOn April 2, Trump announced a minimum 10 percent tariff on all trading partners, as well as higher levies on about 60 nations—typically half of what each levies against the United States. The higher tariffs are due to take effect on April 9.\n\nCanada and Mexico were exempt from the latest tariffs because they are already subject to tariffs of 25 percent that were announced several weeks ago. Those tariffs were levied in a bid to curb illegal immigration and fentanyl trafficking into the United States via its southern and northern neighbors.\n\nTaiwanese President Lai Ching-te on April 6 offered zero tariffs as the basis for talks with the United States, pledging to remove trade barriers rather than imposing reciprocal measures and saying Taiwanese companies would increase their U.S. investments.\n\nAlso in the April 6 interview, Hassett said that U.S. economic data have shown that “we just had one of the stronger jobs reports I’ve seen in a long time,” suggesting that the tariffs could be leading to American jobs.\n\n“[The jobs data] was about 50 percent better than markets expected. It’s the second one in a row,” he said. “We’ve created already something like 10,000 auto jobs since President Trump took office, and I just got word—anecdotal word last night that auto plants are adding second shifts in the U.S. in order to respond to these tariffs these days.”\n\nHassett said that he did not expect a big hit to consumers since exporters were likely to lower prices “because it depends on supply and demand ... elasticity of supply and demand.”\n\n“And again, if you thought consumers are going to pay that tax, then you should be puzzled about why it is that countries are upset about it,” he said.\n\n“The bottom line is that China entered the WTO [World Trade Organization] in 2000. In the 15 years that followed, real incomes declined about $1,200 cumulatively over that time.\n\n“And so, if cheap goods were the answer—if cheap goods were going to make Americans’ real wages, real welfare better off, then real incomes would have gone up over that time. Instead, they went down because wages went down more than prices went down.”\n\nFollowing the tariff announcement, the Dow Jones Industrial Average dropped a combined 4,000 points on April 3 and April 4. The Nasdaq plunged by 5.82 percentage points, and the S&P 500 also posted a similar decline, dropping by 5.97 percent on April 4.\n\nReuters contributed to this report."
  },
  {
    "title": "White House Official Says More Than 50 Countries Reached Out for Tariff Talks",
    "url": "https://www.theepochtimes.com/us/white-house-official-says-more-than-50-countries-reached-out-about-tariffs-5837640?cmt=1",
    "text": "A top White House economic adviser said on April 6 that more than 50 countries have contacted the Trump administration to initiate negotiations over a broad swath of tariffs that were announced in the first week of April on nearly every nation in the world.\n\n“They’re doing that because they understand that they bear a lot of the tariff,” he told the outlet.\n\nOn April 2, Trump announced a minimum 10 percent tariff on all trading partners, as well as higher levies on about 60 nations—typically half of what each levies against the United States. The higher tariffs are due to take effect on April 9.\n\nCanada and Mexico were exempt from the latest tariffs because they are already subject to tariffs of 25 percent that were announced several weeks ago. Those tariffs were levied in a bid to curb illegal immigration and fentanyl trafficking into the United States via its southern and northern neighbors.\n\nTaiwanese President Lai Ching-te on April 6 offered zero tariffs as the basis for talks with the United States, pledging to remove trade barriers rather than imposing reciprocal measures and saying Taiwanese companies would increase their U.S. investments.\n\nAlso in the April 6 interview, Hassett said that U.S. economic data have shown that “we just had one of the stronger jobs reports I’ve seen in a long time,” suggesting that the tariffs could be leading to American jobs.\n\n“[The jobs data] was about 50 percent better than markets expected. It’s the second one in a row,” he said. “We’ve created already something like 10,000 auto jobs since President Trump took office, and I just got word—anecdotal word last night that auto plants are adding second shifts in the U.S. in order to respond to these tariffs these days.”\n\nHassett said that he did not expect a big hit to consumers since exporters were likely to lower prices “because it depends on supply and demand ... elasticity of supply and demand.”\n\n“And again, if you thought consumers are going to pay that tax, then you should be puzzled about why it is that countries are upset about it,” he said.\n\n“The bottom line is that China entered the WTO [World Trade Organization] in 2000. In the 15 years that followed, real incomes declined about $1,200 cumulatively over that time.\n\n“And so, if cheap goods were the answer—if cheap goods were going to make Americans’ real wages, real welfare better off, then real incomes would have gone up over that time. Instead, they went down because wages went down more than prices went down.”\n\nFollowing the tariff announcement, the Dow Jones Industrial Average dropped a combined 4,000 points on April 3 and April 4. The Nasdaq plunged by 5.82 percentage points, and the S&P 500 also posted a similar decline, dropping by 5.97 percent on April 4.\n\nReuters contributed to this report."
  },
  {
    "title": "State Department Revokes, Halts Visas for South Sudan Over Refusal of Deportees",
    "url": "https://www.theepochtimes.com/world/state-department-revokes-halts-visas-for-south-sudan-over-refusal-of-deportees-5837548",
    "text": "The State Department has announced it is freezing all existing and new visas for South Sudanese seeking to enter the United States, citing the transitional government’s refusal to accept its own nationals being deported from the United States.\n\nSecretary of State Marco Rubio announced the new visa and travel restrictions on Saturday, while accusing the East African nation’s leadership of “taking advantage of the United States.”\n\n“Effective immediately, the United States Department of State is taking actions to revoke all visas held by South Sudanese passport holders and prevent further issuance to prevent entry into the United States by South Sudanese passport holders.”\n\nThe secretary said the freeze will remain in force until “South Sudan is in full cooperation.”\n\nSouth Sudan stands on the brink of falling back into civil war after the first vice president was put under house arrest, accused by the president of the transitional government of inciting a rebellion in Nasir in the Upper Nile State in March.\n\nThe arrest threatens a 2018 peace deal that ended a five-year civil war between forces loyal to President Salva Kiir and First Vice President Riek Machar. The deal saw the formation of the Revitalized Transitional Government of National Unity (RTGoNU) in February 2020. The deadly conflict, rooted in communal tensions between Kirr’s Dinka community and Machar’s Nuer community, cost approximately an estimated 400,000 lives.\n\nThe transition government is also facing security challenges in the Upper Nile state, where government forces have clashed with opposition groups."
  },
  {
    "title": "State Department Revokes, Halts Visas for South Sudan Over Refusal of Deportees",
    "url": "https://www.theepochtimes.com/world/state-department-revokes-halts-visas-for-south-sudan-over-refusal-of-deportees-5837548?cmt=1",
    "text": "The State Department has announced it is freezing all existing and new visas for South Sudanese seeking to enter the United States, citing the transitional government’s refusal to accept its own nationals being deported from the United States.\n\nSecretary of State Marco Rubio announced the new visa and travel restrictions on Saturday, while accusing the East African nation’s leadership of “taking advantage of the United States.”\n\n“Effective immediately, the United States Department of State is taking actions to revoke all visas held by South Sudanese passport holders and prevent further issuance to prevent entry into the United States by South Sudanese passport holders.”\n\nThe secretary said the freeze will remain in force until “South Sudan is in full cooperation.”\n\nSouth Sudan stands on the brink of falling back into civil war after the first vice president was put under house arrest, accused by the president of the transitional government of inciting a rebellion in Nasir in the Upper Nile State in March.\n\nThe arrest threatens a 2018 peace deal that ended a five-year civil war between forces loyal to President Salva Kiir and First Vice President Riek Machar. The deal saw the formation of the Revitalized Transitional Government of National Unity (RTGoNU) in February 2020. The deadly conflict, rooted in communal tensions between Kirr’s Dinka community and Machar’s Nuer community, cost approximately an estimated 400,000 lives.\n\nThe transition government is also facing security challenges in the Upper Nile state, where government forces have clashed with opposition groups."
  },
  {
    "title": "Supreme Court Blocks Judge’s Order to Return Man Deported to El Salvador",
    "url": "https://www.theepochtimes.com/us/trump-admin-asks-supreme-court-to-halt-judges-ruling-ordering-return-of-deportee-5838038?cmt=1",
    "text": "The Supreme Court has temporarily blocked a lower court order requiring the federal government to return an illegal immigrant deported to El Salvador, granting the Trump administration a brief reprieve as it appeals the case.\n\nChief Justice John Roberts entered the stay on April 7, pausing a Maryland district judge’s ruling that ordered the Department of Homeland Security (DHS) to bring Salvadoran national Kilmar Abrego-Garcia back to the United States by 11:59 p.m. on April 7.\n\nThe stay, which will remain in effect pending further action by Roberts or the full court, also requires Abrego-Garcia’s legal team to file a response by 5 p.m. on April 8.\n\nAbrego-Garcia entered the United States illegally in about 2011.\n\nDespite the 2019 ruling, Abrego-Garcia was arrested on March 12 by Homeland Security Investigations, a division of Immigration and Customs Enforcement (ICE). Officials cited what they described as his “prominent role” in the MS-13 gang, which the Trump administration had recently designated a foreign terrorist organization. He was placed on a deportation flight three days later, on March 15.\n\nAccording to ICE official Robert Cerna II, Abrego-Garcia had not been on the original manifest for the flight but was listed as an alternate. As other individuals were removed from the flight, Abrego-Garcia’s name was moved up, and he was added to the final passenger list. The manifest, Cerna said, failed to indicate that Abrego-Garcia had legal protection from removal to El Salvador.\n\n“Through administrative error, Abrego-Garcia was removed from the United States to El Salvador,” Cerna said in the filing. “This was an oversight, and the removal was carried out in good faith based on the existence of a final order of removal and Abrego-Garcia’s purported membership in MS-13.”\n\nAbrego-Garcia’s lawyers have argued that there is no credible evidence linking him to MS-13.\n\n“Defendants have claimed—without any evidence—that Abrego Garcia is a member of MS-13 and then housed him among the chief rival gang, Barrio 18,” she wrote.\n\nXinis also rejected the administration’s claim that the court had overstepped its authority, finding that Abrego-Garcia’s deportation was illegal and that the government could not now avoid responsibility by claiming that it lacked the power to correct the mistake.\n\n“Having confessed grievous error, the Defendants now argue that this Court lacks the power to hear this case, and they lack the power to order Abrego Garcia’s return,” she wrote. “To avoid clear irreparable harm, and because equity and justice compels it, the Court grants the narrowest, daresay only, relief warranted: to order that Defendants return Abrego Garcia to the United States.”\n\nIn its filing, the Trump administration warned of sweeping consequences if the lower court’s ruling were allowed to stand.\n\n“The United States cannot guarantee success in sensitive international negotiations in advance, least of all when a court imposes an absurdly compressed, mandatory deadline,” the government wrote.\n\nThey said the court’s order simply requires U.S. officials to correct their own error—not compel foreign action. They also dismissed the government’s public safety claims, noting that Abrego-Garcia has no criminal record and faces serious risk of harm if left in Salvadoran custody."
  },
  {
    "title": "Trump Tells Americans to ‘Hang Tough’ Amid Tariff Turbulence, Promises ‘Historic’ Outcome",
    "url": "https://www.theepochtimes.com/us/trump-tells-americans-to-hang-tough-amid-tariff-turbulence-promises-historic-outcome-5837348",
    "text": "President Donald Trump on Saturday called on Americans to “hang tough” through what he described as a difficult-but-necessary adjustment period following his sweeping new tariff policy, which has reset U.S. trade strategy and triggered a global market selloff.\n\n“We will win. Hang tough, it won’t be easy, but the end result will be historic,” Trump wrote, partially in capital letters. “We will, make America great again!!!”\n\nThe message followed Trump’s April 2 address from the White House, where he declared an economic emergency and announced a 10 percent tariff on nearly all imports. Steeper duties were unveiled for roughly 60 nations identified by the administration as “worst offenders” in trade imbalances with the United States—with China at the top of the list.\n\nSpecific levies include a 34 percent tariff on Chinese imports (raising total tariffs to 54 percent), 46 percent on Vietnam, 24 percent on Japan, and 20 percent on Europe. The global tariffs took effect at 12:01 a.m. on Saturday, with the higher, targeted tariffs scheduled to begin on April 9.\n\nBeijing responded Friday with a 34 percent tariff on all U.S. imports, alongside other retaliatory measures—including a potential restriction on exports of rare-earth elements critical to technologies such as electric vehicles and defense systems.\n\nIn response, Trump said that China can’t afford to retaliate and that his policies have already triggered trillions in new U.S. investment and robust job growth.\n\n“China has been hit much harder than the USA, not even close,” Trump wrote. “They, and many other nations, have treated us unsustainably badly. We have been the dumb and helpless ‘whipping post,’ but not any longer. We are bringing back jobs and businesses like never before. Already, more than five trillion dollars of investment, and rising fast!”\n\nOn Thursday, a day after the announcement, Wall Street saw declines that extended into Friday. The S&P 500 fell 6 percent, the Dow Jones dropped 5.5 percent, and the Nasdaq slid 5.8 percent on April 4.\n\nWhen asked about the market selloff, Trump likened the economy to a patient undergoing surgery.\n\n“I think it’s going very well. We have an operation, like when a patient gets operated on, and it’s a big thing. I said this would exactly be the way it is,” Trump told reporters outside the White House on Thursday.\n\n“Sit back, take it in, let’s see how it goes, because if you retaliate, there will be escalation. If you don’t retaliate, this is the high-water mark,” Bessent told Fox News’s ”Special Report” on Wednesday evening.\n\nBessent also addressed Americans concerned about their retirement savings amid the market downturn, including sharp drops in 401(k)s and IRAs.\n\n“We’re setting the stage for long-term economic growth,” Bessent said, adding that massive government spending had set the country on an unsustainable path: “We were on our way to a financial crisis.”\n\nWhile some countries have vowed to retaliate against Trump’s tariffs, others are taking a more cautious tone.\n\n“We should avoid launching a policy of counter-tariffs that could be damaging for everyone and especially for us,” Italian Economy Minister Giancarlo Giorgetti said at a business forum in Cernobbio, Italy, on Saturday. “Our message is that we need to avoid pushing the panic button. … We are following a pragmatic and rational approach.”\n\nMembers of the Trump administration have argued that America’s $1.2 trillion trade imbalance last year underscores the need for a dramatic policy shift. Trump has long maintained that other nations have taken advantage of the United States and that the new tariffs are designed to restore fairness in global trade."
  },
  {
    "title": "Trump Tells Americans to ‘Hang Tough’ Amid Tariff Turbulence, Promises ‘Historic’ Outcome",
    "url": "https://www.theepochtimes.com/us/trump-tells-americans-to-hang-tough-amid-tariff-turbulence-promises-historic-outcome-5837348?cmt=1",
    "text": "President Donald Trump on Saturday called on Americans to “hang tough” through what he described as a difficult-but-necessary adjustment period following his sweeping new tariff policy, which has reset U.S. trade strategy and triggered a global market selloff.\n\n“We will win. Hang tough, it won’t be easy, but the end result will be historic,” Trump wrote, partially in capital letters. “We will, make America great again!!!”\n\nThe message followed Trump’s April 2 address from the White House, where he declared an economic emergency and announced a 10 percent tariff on nearly all imports. Steeper duties were unveiled for roughly 60 nations identified by the administration as “worst offenders” in trade imbalances with the United States—with China at the top of the list.\n\nSpecific levies include a 34 percent tariff on Chinese imports (raising total tariffs to 54 percent), 46 percent on Vietnam, 24 percent on Japan, and 20 percent on Europe. The global tariffs took effect at 12:01 a.m. on Saturday, with the higher, targeted tariffs scheduled to begin on April 9.\n\nBeijing responded Friday with a 34 percent tariff on all U.S. imports, alongside other retaliatory measures—including a potential restriction on exports of rare-earth elements critical to technologies such as electric vehicles and defense systems.\n\nIn response, Trump said that China can’t afford to retaliate and that his policies have already triggered trillions in new U.S. investment and robust job growth.\n\n“China has been hit much harder than the USA, not even close,” Trump wrote. “They, and many other nations, have treated us unsustainably badly. We have been the dumb and helpless ‘whipping post,’ but not any longer. We are bringing back jobs and businesses like never before. Already, more than five trillion dollars of investment, and rising fast!”\n\nOn Thursday, a day after the announcement, Wall Street saw declines that extended into Friday. The S&P 500 fell 6 percent, the Dow Jones dropped 5.5 percent, and the Nasdaq slid 5.8 percent on April 4.\n\nWhen asked about the market selloff, Trump likened the economy to a patient undergoing surgery.\n\n“I think it’s going very well. We have an operation, like when a patient gets operated on, and it’s a big thing. I said this would exactly be the way it is,” Trump told reporters outside the White House on Thursday.\n\n“Sit back, take it in, let’s see how it goes, because if you retaliate, there will be escalation. If you don’t retaliate, this is the high-water mark,” Bessent told Fox News’s ”Special Report” on Wednesday evening.\n\nBessent also addressed Americans concerned about their retirement savings amid the market downturn, including sharp drops in 401(k)s and IRAs.\n\n“We’re setting the stage for long-term economic growth,” Bessent said, adding that massive government spending had set the country on an unsustainable path: “We were on our way to a financial crisis.”\n\nWhile some countries have vowed to retaliate against Trump’s tariffs, others are taking a more cautious tone.\n\n“We should avoid launching a policy of counter-tariffs that could be damaging for everyone and especially for us,” Italian Economy Minister Giancarlo Giorgetti said at a business forum in Cernobbio, Italy, on Saturday. “Our message is that we need to avoid pushing the panic button. … We are following a pragmatic and rational approach.”\n\nMembers of the Trump administration have argued that America’s $1.2 trillion trade imbalance last year underscores the need for a dramatic policy shift. Trump has long maintained that other nations have taken advantage of the United States and that the new tariffs are designed to restore fairness in global trade."
  },
  {
    "title": "Trump Threatens Additional 50 Percent Tariff in Ultimatum to China",
    "url": "https://www.theepochtimes.com/us/trump-threatens-additional-50-percent-tariff-in-ultimatum-to-china-5838035",
    "text": "President Donald Trump on April 7 threatened to impose an additional 50 percent tariff on China if Beijing does not withdraw its retaliatory measures on U.S. goods.\n\nIn an April 7 Truth Social post, Trump said the Chinese communist regime has until April 8 to reverse its decision. If it fails to do so, the new tariffs will be implemented on April 9.\n\nThe warning follows China’s announcement last week of 34 percent retaliatory tariffs and other trade restrictions in response to the administration’s April 2 rollout of reciprocal duties.\n\nTrump condemned China’s response, writing that Beijing’s latest tariffs come “on top of their already record setting Tariffs, Non-Monetary Tariffs, Illegal Subsidization of companies, and massive long term Currency Manipulation.”\n\nHe reiterated his previous warning that any country retaliating against the United States would face “new and substantially higher Tariffs, over and above those initially set.”\n\nThe president also made clear that all trade negotiations with China would be terminated if Beijing failed to rescind its new tariffs.\n\nAt an April 7 press conference, Trump said that the United States has “one shot” to correct trade imbalances with China that have built up for decades. He said that no future president is likely to take similar action.\n\n“I'll tell you what, it’s an honor to do it because we have been just ... just destroyed, what they’ve done to our system,” Trump said at the Oval Office, adding that the U.S. debt of more than $36 trillion was caused in part by prior administrations that allowed unfavorable trade imbalances to continue.\n\nTrump has long argued that other countries have taken advantage of the United States through unfair trade practices and that a new tariff arrangement is essential to restoring balance. Administration officials have said that last year’s $1.2 trillion trade deficit highlights the need for sweeping changes, with tariffs playing a central role.\n\nOn April 2, Trump declared an economic emergency and announced a 10 percent baseline tariff on nearly all imports. Steeper duties, amounting to roughly 50 percent of the tariffs and other trade barriers enacted on the United States by each respective country, were unveiled for roughly 60 nations identified by the administration as the “worst offenders” in trade imbalances with the United States—with China topping that list. Other countries subjected to the higher tariffs include Vietnam (46 percent), Japan (24 percent), and Europe (20 percent).\n\nThe administration’s 34 percent reciprocal tariffs on China—targeting currency manipulation, industrial subsidies, and other trade practices—are being added to existing 20 percent duties already applied to Chinese imports. Together, they bring the total tariff rate to 54 percent, affecting nearly $600 billion in annual trade.\n\nIn response, Beijing launched a series of countermeasures, including tighter export controls on several categories of rare-earth minerals and the addition of more U.S. firms to its “unreliable entity list.” The blacklist targets foreign businesses that the Chinese regime deems a threat to its national security and economic development.\n\nThe Chinese Ministry of Foreign Affairs issued a weekend statement saying Beijing is prepared to “open its doors wider” to global trading partners—signaling interest in a possible pivot away from U.S.-focused trade relationships.\n\nHowever, Trump has dismissed China’s ability to mount an effective counteroffensive, claiming that the country is already reeling from earlier tariff effects. He credited his administration’s trade agenda with generating trillions of dollars in new investment and strong job growth in the United States.\n\n“China has been hit much harder than the USA, not even close,” Trump wrote in a post on Truth Social. “They, and many other nations, have treated us unsustainably badly.”\n\nDuring the April 2 announcement of the reciprocal tariffs, Trump held up a chart listing countries and territories that had put up trade barriers to the United States.\n\n“If you look at that ... China, first row, 67 percent. That’s tariffs charged to the USA, including currency manipulation and trade barriers,” Trump explained. “We are going to be charging [them] a discounted reciprocal tariff of 34 percent. ... We charge them less. So how can anybody be upset?”\n\nWhile the exact basis for the 67 percent figure is unclear, the Office of the U.S. Trade Representative said in a note on its reciprocal tariff calculations that assessing all of the various tariff, regulatory, tax, and other policies is very difficult, but that their “combined effects can be proxied by computing the tariff level consistent with driving bilateral trade deficits to zero.”\n\nBy estimating what tariff rate would eliminate the trade deficit—which in 2024 amounted to $295.4 billion with China—the Trump administration argues that it can approximate the cumulative effect of China’s various trade barriers against the United States and apply reciprocal rates that begin to level the playing field.\n\nThe sweeping tariffs have rattled markets, with U.S. stocks extending their selloff in a volatile April 7 trading session. Trump and his advisers have described the economic turbulence as a necessary but temporary phase in what the president has dubbed an “economic revolution.”\n\n“We will win,“ Trump wrote in a post on social media. ”Hang tough, it won’t be easy, but the end result will be historic.”\n\nTreasury Secretary Scott Bessent echoed those sentiments, saying that a key goal of the tariffs is to reduce the federal deficit and create fiscal space for tax relief, particularly for lower-income Americans.\n\nIn an April 4 interview with Tucker Carlson, Bessent said the administration has already collected several hundred million dollars from the newly implemented China tariffs, in addition to the $35 billion generated annually thanks to the tariffs that Trump imposed on China during his first term. Bessent projected that revenue from the broader tariff package could eventually reach between $300 billion and $600 billion per year.\n\nThat money, Bessent said, would be directed toward four policy priorities aimed at working-class Americans: eliminating taxes on tips, Social Security benefits, and overtime pay and making interest payments on U.S.-made auto loans tax-deductible.\n\n“Think [about] what the president is doing here,” Bessent said. “He is backing into an affordability solution for the bottom 50 percent of wage earners because they’re the ones who will benefit from all four of those programs.”\n\nWhile some countries—such as China—have responded to Trump’s tariffs with countermeasures, others have opened the door to negotiations in search of a resolution.\n\nSome analysts warn that hopes for swift rollbacks of tariffs or trade deals may be premature.\n\n“There will likely be some rally attempts on hopes for tariff rollbacks and/or negotiations with trade partners,” John Belton, a portfolio manager at Gabelli Funds, said in a note to The Epoch Times.\n\n“Unfortunately, we are of the view that the bigger picture is very clear: Tariffs are here to stay and will be much higher than they’ve been in decades. The market has to learn how to deal with this new reality.”\n\nTom Ozimek contributed to this report."
  },
  {
    "title": "Trump Threatens Additional 50 Percent Tariff in Ultimatum to China",
    "url": "https://www.theepochtimes.com/us/trump-threatens-additional-50-percent-tariff-in-ultimatum-to-china-5838035?cmt=1",
    "text": "President Donald Trump on April 7 threatened to impose an additional 50 percent tariff on China if Beijing does not withdraw its retaliatory measures on U.S. goods.\n\nIn an April 7 Truth Social post, Trump said the Chinese communist regime has until April 8 to reverse its decision. If it fails to do so, the new tariffs will be implemented on April 9.\n\nThe warning follows China’s announcement last week of 34 percent retaliatory tariffs and other trade restrictions in response to the administration’s April 2 rollout of reciprocal duties.\n\nTrump condemned China’s response, writing that Beijing’s latest tariffs come “on top of their already record setting Tariffs, Non-Monetary Tariffs, Illegal Subsidization of companies, and massive long term Currency Manipulation.”\n\nHe reiterated his previous warning that any country retaliating against the United States would face “new and substantially higher Tariffs, over and above those initially set.”\n\nThe president also made clear that all trade negotiations with China would be terminated if Beijing failed to rescind its new tariffs.\n\nAt an April 7 press conference, Trump said that the United States has “one shot” to correct trade imbalances with China that have built up for decades. He said that no future president is likely to take similar action.\n\n“I'll tell you what, it’s an honor to do it because we have been just ... just destroyed, what they’ve done to our system,” Trump said at the Oval Office, adding that the U.S. debt of more than $36 trillion was caused in part by prior administrations that allowed unfavorable trade imbalances to continue.\n\nTrump has long argued that other countries have taken advantage of the United States through unfair trade practices and that a new tariff arrangement is essential to restoring balance. Administration officials have said that last year’s $1.2 trillion trade deficit highlights the need for sweeping changes, with tariffs playing a central role.\n\nOn April 2, Trump declared an economic emergency and announced a 10 percent baseline tariff on nearly all imports. Steeper duties, amounting to roughly 50 percent of the tariffs and other trade barriers enacted on the United States by each respective country, were unveiled for roughly 60 nations identified by the administration as the “worst offenders” in trade imbalances with the United States—with China topping that list. Other countries subjected to the higher tariffs include Vietnam (46 percent), Japan (24 percent), and Europe (20 percent).\n\nThe administration’s 34 percent reciprocal tariffs on China—targeting currency manipulation, industrial subsidies, and other trade practices—are being added to existing 20 percent duties already applied to Chinese imports. Together, they bring the total tariff rate to 54 percent, affecting nearly $600 billion in annual trade.\n\nIn response, Beijing launched a series of countermeasures, including tighter export controls on several categories of rare-earth minerals and the addition of more U.S. firms to its “unreliable entity list.” The blacklist targets foreign businesses that the Chinese regime deems a threat to its national security and economic development.\n\nThe Chinese Ministry of Foreign Affairs issued a weekend statement saying Beijing is prepared to “open its doors wider” to global trading partners—signaling interest in a possible pivot away from U.S.-focused trade relationships.\n\nHowever, Trump has dismissed China’s ability to mount an effective counteroffensive, claiming that the country is already reeling from earlier tariff effects. He credited his administration’s trade agenda with generating trillions of dollars in new investment and strong job growth in the United States.\n\n“China has been hit much harder than the USA, not even close,” Trump wrote in a post on Truth Social. “They, and many other nations, have treated us unsustainably badly.”\n\nDuring the April 2 announcement of the reciprocal tariffs, Trump held up a chart listing countries and territories that had put up trade barriers to the United States.\n\n“If you look at that ... China, first row, 67 percent. That’s tariffs charged to the USA, including currency manipulation and trade barriers,” Trump explained. “We are going to be charging [them] a discounted reciprocal tariff of 34 percent. ... We charge them less. So how can anybody be upset?”\n\nWhile the exact basis for the 67 percent figure is unclear, the Office of the U.S. Trade Representative said in a note on its reciprocal tariff calculations that assessing all of the various tariff, regulatory, tax, and other policies is very difficult, but that their “combined effects can be proxied by computing the tariff level consistent with driving bilateral trade deficits to zero.”\n\nBy estimating what tariff rate would eliminate the trade deficit—which in 2024 amounted to $295.4 billion with China—the Trump administration argues that it can approximate the cumulative effect of China’s various trade barriers against the United States and apply reciprocal rates that begin to level the playing field.\n\nThe sweeping tariffs have rattled markets, with U.S. stocks extending their selloff in a volatile April 7 trading session. Trump and his advisers have described the economic turbulence as a necessary but temporary phase in what the president has dubbed an “economic revolution.”\n\n“We will win,“ Trump wrote in a post on social media. ”Hang tough, it won’t be easy, but the end result will be historic.”\n\nTreasury Secretary Scott Bessent echoed those sentiments, saying that a key goal of the tariffs is to reduce the federal deficit and create fiscal space for tax relief, particularly for lower-income Americans.\n\nIn an April 4 interview with Tucker Carlson, Bessent said the administration has already collected several hundred million dollars from the newly implemented China tariffs, in addition to the $35 billion generated annually thanks to the tariffs that Trump imposed on China during his first term. Bessent projected that revenue from the broader tariff package could eventually reach between $300 billion and $600 billion per year.\n\nThat money, Bessent said, would be directed toward four policy priorities aimed at working-class Americans: eliminating taxes on tips, Social Security benefits, and overtime pay and making interest payments on U.S.-made auto loans tax-deductible.\n\n“Think [about] what the president is doing here,” Bessent said. “He is backing into an affordability solution for the bottom 50 percent of wage earners because they’re the ones who will benefit from all four of those programs.”\n\nWhile some countries—such as China—have responded to Trump’s tariffs with countermeasures, others have opened the door to negotiations in search of a resolution.\n\nSome analysts warn that hopes for swift rollbacks of tariffs or trade deals may be premature.\n\n“There will likely be some rally attempts on hopes for tariff rollbacks and/or negotiations with trade partners,” John Belton, a portfolio manager at Gabelli Funds, said in a note to The Epoch Times.\n\n“Unfortunately, we are of the view that the bigger picture is very clear: Tariffs are here to stay and will be much higher than they’ve been in decades. The market has to learn how to deal with this new reality.”\n\nTom Ozimek contributed to this report."
  },
  {
    "title": "China Refuses to Budge After US Threatens Extra 50 Percent Tariff",
    "url": "https://www.theepochtimes.com/china/china-refuses-to-budge-after-us-threatens-extra-50-percent-tariff-5838371?cmt=1",
    "text": "Beijing on Tuesday criticized President Donald Trump’s threat to impose an additional 50 percent tariff on Chinese imports in response to China’s retaliatory measures against the U.S. reciprocal tariffs.\n\nThe Chinese Commerce Ministry said it would be a mistake if Trump proceeds with the extra tariffs and vowed to “fight to the end” to protect its interests.\n\nTrump warned that he would impose additional 50 percent duties on Chinese goods if China refused to withdraw its 34 percent retaliatory tariffs on U.S. imports. Beijing’s tariffs were imposed after Trump’s April 2 reciprocal tariff announcement, which raised the total U.S. tariff on Chinese imports to 54 percent.\n\nThis is a developing story and will be updated."
  },
  {
    "title": "Trump Confirms He Won’t Pause Tariff Plan, Says ‘Many Countries’ Seeking Deals",
    "url": "https://www.theepochtimes.com/us/trump-confirms-he-wont-pause-tariff-plan-says-many-countries-seeking-deals-5838222",
    "text": "President Donald Trump said on Monday that he is not looking to pause his tariff plan, as countries seek to negotiate deals with the White House.\n\nEarlier Monday, the three major U.S. stock indexes saw-sawed after CNBC aired “unconfirmed information” claiming that Trump was considering a 90-day pause. But the White House said on social media that such reports were “fake news.”\n\nLater, when speaking to reporters in the Oval Office, Trump was asked about a possible pause on tariffs to allow talks on deals.\n\n“Well, we’re not looking at that,” the president responded. “We have many, many countries that are coming to negotiate deals with us, and they’re going to be fair deals. And in certain cases, they’re going to be paying substantial tariffs. There will be fair deals.”\n\nSeveral countries have publicly indicated they want to lower their tariff rates on U.S. goods, with European Commission President Ursula von der Leyen saying the European Union could go “zero-for-zero” with the United States. Leaders in Taiwan, Thailand, Vietnam, and other countries have also indicated they would engage in talks.\n\nTrump told reporters that von der Leyen’s offer was not good enough. “They’re screwing us on trade,” Trump said in response to a question about her proposal.\n\n“If China does not withdraw its 34 percent increase above their already long-term trading abuses by tomorrow, April 8th, 2025, the United States will impose ADDITIONAL Tariffs on China of 50 percent, effective April 9th,” Trump wrote in a Truth Social post.\n\nTreasury Secretary Scott Bessent, meanwhile, said the United States is open to negotiations with Japan due to the country’s “outreach and measured approach.”\n\nThe back-and-forth public statements on tariffs injected further turbulence into global financial markets, which have fallen steadily since Trump’s announcement. U.S. stocks swung wildly, spiking after a report on a possible 90-day tariff pause and then turning negative again after the White House dismissed the claim.\n\nTrump administration officials say the president is following through on a promise to reverse decades of trade liberalization that he believes has undercut the U.S. economy. During his 2024 presidential campaign, Trump often said he would impose tariffs on countries to offset longstanding trade deficits.\n\nLast week, Trump announced a baseline 10 percent tariff on all countries, while more significant trading partners such as China, the EU, and Vietnam would see higher rates.\n\n“He’s doubling down on something that he knows works, and he’s going to continue to do that,” White House economist Kevin Hassett said on Fox News on Monday. “But he is also going to listen to our trading partners, and if they come to us with really great deals that advantage American manufacturing and American farmers, I’m sure he'll listen.”\n\nReuters contributed to this report."
  },
  {
    "title": "Appeals Court Rejects Trump Admin’s Bid to Fast-Track Deportations to Third Countries",
    "url": "https://www.theepochtimes.com/us/appeals-court-rejects-trump-admins-bid-to-fast-track-deportations-to-third-countries-5838334?cmt=1",
    "text": "A federal appeals court has denied the Trump administration’s request to lift a temporary restraining order blocking the government from fast-tracking the deportation of illegal immigrants with final removal orders to new countries without first giving such individuals a chance to raise claims that they would face persecution or torture if sent there.\n\nIn his March 28 ruling, Murphy concluded that the government must provide individuals with written notice and a meaningful opportunity to apply for protection under U.S. law, including the Convention Against Torture, before deporting them to third countries with which they have no established ties.\n\nThe Justice Department, in its emergency motion, argued that the court had exceeded its authority by imposing new procedural obligations on the executive branch and interfering with the administration’s statutory authority to carry out removals.\n\n“The district court has usurped core executive powers and imposed tremendous practical effects on the President’s authority to manage foreign affairs, including with allies who may wish to accept aliens who are not citizens,” DOJ attorneys wrote.\n\nThe DOJ also pointed to a new directive issued by DHS in response to the district court’s ruling. That guidance requires that any country receiving a deportee under such circumstances provide diplomatic assurances that the individual will not be persecuted or tortured. DOJ attorneys maintained that, beyond this guidance, illegal immigrants may also raise protection claims through existing administrative channels, such as filing a motion to reopen with DHS, immigration courts, or the Board of Immigration Appeals.\n\n“Plaintiffs focus on the lack of notice regarding the country of removal as if their fear depends on receiving that notice. It does not,” DOJ attorneys wrote, arguing that the administrative process is sufficient and that plaintiffs are seeking relief in district court merely for convenience.\n\n“Defendants assert unfettered authority to deport noncitizens to countries that were not previously designated in immigration proceedings without providing any notice of which country, and thus without any meaningful opportunity to seek protection from persecution or torture in that unidentified country,” attorneys for the plaintiffs wrote.\n\nThey added that a motion to reopen is not a practical remedy for many would-be deportees, especially those who are detained, unrepresented, or unaware of where they are being sent until it is too late to act.\n\nThe Justice Department did not respond to a request for comment on the appellate court’s decision by publication time.\n\nThe case now returns to the district court, where Murphy is expected to hold a hearing on the plaintiffs’ motion for a preliminary injunction in the coming days. The outcome of that hearing could determine whether the restrictions on third-country deportations remain in effect for the duration of the litigation."
  },
  {
    "title": "Border Patrol Agents Rescue 2 Women in California Wilderness",
    "url": "https://www.theepochtimes.com/us/border-patrol-agents-rescue-2-women-in-california-wilderness-5837502",
    "text": "U.S. Border Patrol agents rescued two injured women, including one who was pregnant, stranded in the Otay Mountain Wilderness during a cold front, the agency announced on April 1.\n\nThe rescue began shortly after midnight on March 28 when agents from the Chula Vista Station responded to a distress call relayed by Mexican authorities. The two women, both Mexican nationals who had crossed the border illegally, were found in a remote canyon about six miles east of the Otay Mesa Port of Entry. Both reported ankle injuries and neither had food or water.\n\nDue to poor weather, including dense fog and low cloud cover, emergency medical services could not immediately extract the women. Border Patrol’s Search, Trauma, and Rescue Team remained with the injured pair overnight and built a makeshift shelter to shield them from near-freezing temperatures.\n\nOnce weather conditions improved in the morning, a San Diego County Sheriff’s Department helicopter airlifted the women to safety. They were taken to a nearby fire station for medical evaluation before being transported to a Border Patrol facility for processing and removal from the country.\n\n“The border region can be treacherous, with extreme weather and rugged terrain posing serious dangers. Entering illegally not only breaks the law but also puts lives at risk,” Stalnaker said.\n\nThe Otay Mountain Wilderness is a federally designated wilderness area in San Diego County, about 12 miles east of the community of Otay Mesa and just north of the U.S.-Mexico border. The terrain is rugged and steep, rising rapidly from sea level to more than 3,500 feet at the summit of Otay Mountain.\n\nBorder officials emphasized the ongoing dangers of illegal border crossings, particularly in mountainous or desert terrain, where migrants face threats such as injury, dehydration, and hypothermia."
  },
  {
    "title": "Why US Has Upper Hand Over Beijing in Tariff Standoff",
    "url": "https://www.theepochtimes.com/china/why-us-has-upper-hand-over-beijing-in-tariff-standoff-5838158?cmt=1",
    "text": "News Analysis\n\nAs reciprocal tariffs on U.S trading partners are set to take effect on Wednesday, President Donald Trump has focused much of his attention on the Chinese regime.\n\nSeveral experts say that while many world leaders will eventually meet U.S. demands after the initial kicking and screaming, Chinese Communist Party (CCP) leader Xi Jinping will not—even with the added ultimatum.\n\n“Xi has sold himself domestically and internationally as the guy standing up to America, and people that want to stand up to America should get in line behind chairman Xi,” Christopher Balding, a senior fellow at the Henry Jackson Society, a UK-based think tank, told The Epoch Times.\n\n“It would be catastrophic for Xi to be seen as caving in to Trump in any way,” he said.\n\nExperts also said the CCP cannot and does not want to give the United States what it wants: for China to control its fentanyl precursor exports and open up its market.\n\nThe current U.S.–China tariff standoff is more than a trade conflict, according to Yeh Yao-Yuan, a professor of international studies at the University of St. Thomas in Houston.\n\n“It’s a more aggressive decoupling because escalated tariffs will cause the bilateral trade to drop further,” Yeh told The Epoch Times. “When the decoupling persists, it will lead to a cold war.”\n\nChina expert Alexander Liao thinks the current situation will eventually become a contest between Trump and Xi. Trump depends on the might of the U.S. economy, while Xi relies on support from the communist regime’s tight control system.\n\nGiven this, Liao said Xi is disadvantaged because he has little policy room to maneuver.\n\n“Washington has many cards. Beijing has few,” he told The Epoch Times.\n\nWhile China was at the top of the list, it didn’t receive the highest rate. Other Southeast Asian countries that Chinese companies use for transshipping, including Vietnam and Cambodia, received nearly 50 percent levies.\n\nHowever, Balding said that the administration’s real target was China.\n\n“I think they want to be much more aggressive with China, but they want to do it very quietly,” he said.\n\n“They did it almost, in a way, to shield China,” he added, referring to the administration’s approach of announcing sweeping global tariffs so the levy on Chinese goods didn’t stand out as much.\n\nBalding noted that Trump applies tariffs differently to other countries than he does to China. In the case of the U.S. tariffs on other nations, the rates are set to encourage negotiations. However, Balding remarked that the tariffs imposed on China are so high that negotiations are very hard for Beijing.\n\nThree countries were on the receiving end of the earlier 25-percent fentanyl tariffs: Canada, Mexico, and China.\n\nThe two North American countries were exempted from last week’s reciprocal tariffs. The White House said Canada and Mexico will remain on the fentanyl tariff regime and move to the reciprocal tariff regime after they reach a bilateral agreement with the United States.\n\nBy comparison, China received a reciprocal levy in addition to the fentanyl tariffs. Most Chinese imports are now subjected to a more than 60 percent levy; the amount Trump talked about on the campaign trail.\n\nAccording to Balding, such a steep tariff at the start of the negotiation makes it very difficult for Xi to reach any deal. The Chinese leader, he said, would have to make a lot of concessions to the United States—compromises that Xi isn’t willing to give—for Washington to cut the rate by half. Even if that were to happen, the remaining half would still be too high for China to bear, Balding added.\n\n“What does Trump want? It seems to me he is basically saying, ‘Let’s just decouple everything as much as we can from China,’” the expert said.\n\nSince Trump returned to the White House, many of his foreign policies have been directly and indirectly driven by China.\n\n“Basically [Trump] said, ‘I can’t let any part of the world be a place where China or other countries can ship through them,'” Lutnick said.\n\nSecretary of State Marco Rubio visited Panama as part of his first official foreign trip. Shortly after, Panama said it would not renew its agreement with China’s Belt and Road Initiative, a geopolitical platform for the CCP to expand its global influence.\n\nDuring the first administration, Trump took two years to negotiate and sign a “phase one” trade deal with China. Eventually, Beijing did not fulfill its pledge to buy an additional $200 billion in U.S. products over two years.\n\nLiao said the CCP’s strategy is to draw things out. For example, it may take two years to reach an agreement and another year for Washington to discover that Beijing hasn’t made good on its promises.\n\nUnder this cycle, the United States bears the cost of such delays.\n\nThis time around, by imposing the tariffs upfront, Trump has immediately put the cost on Xi, Liao said.\n\nBalding agrees.\n\n“If you want to draw this out for years and years—go ahead,” Balding said, describing Trump’s approach. “We’re going to impose enormous amounts of pain very early on so that if you want to draw it out, you’re drawing out your pain.”\n\nThe U.S. trade deficit with China was about $300 billion last year. That means the negative impact of a 34 percent tariff will be felt much more sharply in China than in the United States.\n\nThat’s partly why Trump has been pursuing critical minerals in Ukraine, Liao said. Eventually, when the prices of these raw materials for weapons and electronics are no longer kept artificially low due to China’s monopoly, he added, more companies will join the processing businesses.\n\nAccording to U.S.-based economist Davy J. Wong, the United States and China are not in a trade war, but a battle for resetting the international trade protocol and even the world order.\n\nFor Xi, the resilience of the communist political system is the key, according to Liao. Chinese people will become poorer and more dissatisfied. However, if the communist apparatus keeps a lid on the people, Xi could hold out.\n\nTrump’s pain would come from the U.S. economy, Liao said. If the economy can survive the initial shock and voters don’t lose patience with Trump, he can remain focused on standing firm against the CCP.\n\nThe U.S. stock market experienced large drops last week, driven mainly by the uncertainty of the global reciprocal tariffs. With the biggest three-day decline since the summer of 2020 during the COVID-19 pandemic, more than $6 trillion in value evaporated in the equity market.\n\nThe stock market upheaval has added pressure on the White House and Trump, who has often credited the administration’s work for the rise of the stock market.\n\nBalding said Trump will most likely hold out while the stock market adjusts because the U.S. government is prioritizing national security, which is different to Wall Street’s focus on business profits.\n\nThe president has also tied the U.S.–China trade imbalance to national security, saying that Beijing uses its massive surplus with the United States to fund the military.\n\n“We don’t want that. I don’t want them to take $500 [billion], $600 billion a year and spend it on their military,” Trump said in the Oval Office on April 7.\n\nBoth Balding and Yeh believe that if Trump can negotiate agreements with key countries—such as Vietnam, South Korea, and Japan—to significantly reduce tariffs within the next month, businesses will gain more certainty. This would contribute to stabilizing the stock market.\n\nWashington holds more cards, Liao said.\n\nIn addition to further hiking tariffs, Liao said the United States could apply more pressure to the CCP by uniting with China’s neighbors who don’t like the regime, such as Vietnam and India. The United States could also take a human rights approach and release a report about the origins of COVID-19 or publicize evidence of the forced organ harvesting of prisoners of conscience and ethnic minorities in China.\n\nAndrew Moran and Luo Ya contributed to this report."
  }
]